{
  "crawled_at": "2026-01-22T06:26:45.188729",
  "total_publications": 162,
  "total_authors": 47,
  "source_url": "https://pureportal.coventry.ac.uk/en/organisations/ics-research-centre-for-computational-science-and-mathematical-mo/persons/",
  "publications": [
    {
      "title": "Learning from less: SINDy Surrogates in RL",
      "authors": [
        "Dixit, A.",
        "Khan, M. I.",
        "Ahmed, F.",
        "Brusey, J."
      ],
      "year": "2025",
      "abstract": "This paper presents a method to create simpler versions of reinforcement learning (RL) environments using the Sparse Identification of Nonlinear Dynamics (SINDy) algorithm. The method was tested in OpenAI Gym's Mountain Car and Lunar Lander environments. Results show that these SINDy-based models can closely match the real environment's behavior while cutting down computational cost by 20–35%. With just 75 data points for Mountain Car and 1000 for Lunar Lander, the models achieved over 0.997 state-wise correlation, with very low prediction errors (as low as 3.11 × 10⁻⁶ for Mountain Car velocity and 1.42 × 10⁻⁶ for Lunar Lander position). RL agents trained in these simplified environments needed fewer steps to learn (65,075 vs. 100,000 for Mountain Car and 801,000 vs. 1,000,000 for Lunar Lander) and performed similarly to those trained in the full environments. This work offers a fast and accurate way to create interpretable models for use in model-based RL.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/learning-from-less-sindy-surrogates-in-rl/",
      "author_profiles": {
        "Dixit, A.": "https://pureportal.coventry.ac.uk/en/persons/aniket-dixit/",
        "Khan, M. I.": "https://pureportal.coventry.ac.uk/en/persons/muhammad-ibrahim-khan/",
        "Ahmed, F.": "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "Faizan Ahmed",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
      "crawled_at": "2026-01-22T06:00:55.939646"
    },
    {
      "title": "Reinforcement Learning for Building Control: Direct Actuator or PID-Mediated Control?",
      "authors": [
        "Dixit, A.",
        "Ahmed, F.",
        "Brusey, J."
      ],
      "year": "2025",
      "abstract": "Building control systems typically use either setpoint regulation, where controllers determine optimal setpoints for low-level systems, or direct actuator control, which bypasses the setpoint layer. Despite widespread hierarchical approaches, empirical evidence comparing these strategies remains limited. This paper presents a systematic evaluation of both paradigms using reinforcement learning (RL) with the Building Optimization Performance Test (BOPTEST) framework. We implement and compare: (1) setpoint-trained RL agents using PPO, DQN, and A2C algorithms, (2) direct actuation-controlled RL agents with identical algorithms, and (3) a conventional PI controller baseline. Experiments span two simulation environments (BESTEST Hydronic Heat Pump and BESTEST Air systems) with constant electricity pricing. Results demonstrate that setpoint regulation achieves near-perfect thermal comfort (> 99% discomfort reduction) with modest energy cost increases (4.8–5.0%), while direct actuator control offers smaller energy penalties (1.8–3.2%) with substantial comfort improvements (> 80% discomfort reduction). Most significantly, setpoint regulation consistently demonstrated faster learning, requiring 48–79% fewer training steps across algorithms and environments. The setpoint-trained approach also exhibited 38% lower control signal variance (measured as the standard deviation of actuator commands) over the 14-day testing period. These findings provide quantitative evidence supporting a two-level control architecture, where an RL agent optimizes setpoints for existing low-level controllers, while also identifying conditions where direct actuator control by an RL agent may be advantageous. Our research contributes valuable empirical insights for designing energy-efficient building control strategies using reinforcement learning, with setpoint regulation offering significant advantages in training efficiency and control stability.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/reinforcement-learning-for-building-control-direct-actuator-or-pi/",
      "author_profiles": {
        "Dixit, A.": "https://pureportal.coventry.ac.uk/en/persons/aniket-dixit/",
        "Ahmed, F.": "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "Faizan Ahmed",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
      "crawled_at": "2026-01-22T06:01:02.600613"
    },
    {
      "title": "A Hybrid Physics-Informed Neural Network: SEIRD Model for Forecasting COVID-19 Intensive Care Unit Demand in England",
      "authors": [
        "Ajao-Olarinoye, M.",
        "Palade, V.",
        "He, F.",
        "Wark, P. A."
      ],
      "year": "2025",
      "abstract": "COVID-19 poses a complex and unprecedented challenge to public health and society, requiring scientific efforts to understand, model, diagnose, and control the disease. The integration of physics-informed neural networks (PINNs) with epidemiological models offers a powerful tool for understanding the dynamics of infectious diseases and developing effective strategies to control and mitigate their impact. In this study, we develop a novel hybrid approach to modelling and forecasting the dynamics and the demand for healthcare resources. We take advantage of the concept of PINNs to capture the dynamics of infectious diseases, estimate key parameters, and unobserved states in the ability of the model, using the neural network to integrate physical laws directly into the learning process of a modified compartmental model. We also make use of the strength of recurrent neural networks (RNNs) to combine data generated by a PINN and lagged covariates of target variables to forecast demand from the intensive care unit demand using different variations of RNN models. The results indicate that our proposed hybrid framework is highly effective in capturing the dynamics of the pandemic and providing insight into the dynamics of the disease.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-hybrid-physics-informed-neural-network-seird-model-for-forecast/",
      "author_profiles": {
        "Ajao-Olarinoye, M.": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
        "Wark, P. A.": "https://pureportal.coventry.ac.uk/en/persons/petra-wark/"
      },
      "crawled_from_author": "Michael Ajao-olarinoye",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
      "crawled_at": "2026-01-22T06:01:17.265177"
    },
    {
      "title": "Fluid–structure interaction analysis of pulsatile flow in arterial aneurysms with physics-informed neural networks and computational fluid dynamics",
      "authors": [
        "Ajao-Olarinoye, M.",
        "Liu, H."
      ],
      "year": "2025",
      "abstract": "Marfan syndrome (MS) is a genetic disorder often associated with the development of aortic aneurysms, leading to severe vascular complications. The progression of this condition is intricately linked to hemodynamic factors such as wall shear stress (WSS) and von Mises stress, as abnormal distributions can contribute to thrombus formation, endothelial damage, and the worsening of aneurysmal conditions. In this study, six vascular models were analyzed: four representing diseased aortas with Marfan syndrome aneurysms and two healthy aortic models for comparison. The models were sourced from Vascular Model Repository, and computational fluid dynamics (CFD) simulations were conducted using a Newtonian fluid model and the shear stress transport (SST) k- ω turbulent transitional model to evaluate WSS and von Mises stress. Fluid-structure interaction was employed to incorporate vessel wall interaction, and pulsatile inlet velocity profiles were used to simulate physiological blood flow, capturing time-dependent hemodynamic variations. The results revealed significant differences between healthy and diseased aortic models. In healthy models, WSS was uniformly distributed, with values consistently below 40 Pa, reflecting stable vascular conditions. Conversely, the diseased models exhibited highly non-uniform WSS distributions, with notably lower values in aneurysmal regions, contributing to thrombus formation, with elevated WSS in areas like the carotid and subclavian arteries due to geometric and hemodynamic complexities. The von Mises stress analysis identified regions of heightened rupture risk, particularly on the superior side of case MS1, where both von Mises stress and WSS reached their highest values among all cases. Physics-informed neural networks demonstrated strong agreement with CFD results while significantly reducing computational cost, highlighting their potential for real-time clinical applications. These findings underscore the critical role of hemodynamic f",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/fluidstructure-interaction-analysis-of-pulsatile-flow-in-arterial/",
      "author_profiles": {
        "Ajao-Olarinoye, M.": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
        "Liu, H.": "https://pureportal.coventry.ac.uk/en/persons/haipeng-liu/"
      },
      "crawled_from_author": "Michael Ajao-olarinoye",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
      "crawled_at": "2026-01-22T06:01:24.427634"
    },
    {
      "title": "Deep Learning Based Forecasting of COVID-19 Hospitalisation in England: A Comparative Analysis",
      "authors": [
        "Ajao-olarinoye, M.",
        "Palade, V.",
        "He, F.",
        "Wark, P. A."
      ],
      "year": "2024",
      "abstract": "In the midst of the COVID-19 pandemic, it was essential to accurately forecast the demand for hospitalisation resources to achieve an effective allocation of healthcare resources. This paper explores the potential of various Deep Learning (DL) models, namely basic Recurrent Neural Networks (RNNs), Long Short-Term Memory networks (LSTMs), Gated Recurrent Units (GRU), Bidirectional RNNs, and Sequence-to-Sequence architectures with the inclusion of attention mechanisms, to forecast the demand for hospitalisation resources (mechanical ventilators) in England during the COVID-19 pandemic. The implementation of simulated annealing (SA) as a hyperparameter tuning method produced certain model structures and good results in terms of prediction accuracy. Our findings show that the LSTM-based models (LSTM_SA), achieved the lowest mean average error (MAE), outperforming other architectures used in this study. The results of this study show the potential of DL models to forecast the demand for resources and could help inform the distribution of hospitalisation resources in England during the COVID-19 pandemic.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/deep-learning-based-forecasting-of-covid-19-hospitalisation-in-en/",
      "author_profiles": {
        "Ajao-olarinoye, M.": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
        "Wark, P. A.": "https://pureportal.coventry.ac.uk/en/persons/petra-wark/"
      },
      "crawled_from_author": "Michael Ajao-olarinoye",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
      "crawled_at": "2026-01-22T06:01:31.074356"
    },
    {
      "title": "Allocating Medical Resources (vaccine) to Control a Pandemic",
      "authors": [
        "Ajao-olarinoye, M."
      ],
      "year": "2022",
      "abstract": "In the aftermath of the COVID-19 pandemic, we need to better understand how to prepare for other pandemics in the future. This research uses computational techniques to better understand how medical resources can be allocated to controlling pandemics. Mathematical modelling techniques are used to study the transmission dynamics of infectious diseases, and to estimate the cost of implementing control measures. A mathematical model is used to solve problem statements drawn from assumptions. Optimizing the allocation of resources can be achieved by using algorithms to optimise the cost of distributing resources in order to control a pandemic. The goal of this research would be to find the most cost-effective algorithm, utilizing all operational research methodologies. In general, the product is software that implements the best algorithm designed to deal with the problem of resource allocation for pandemics.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/allocating-medical-resources-vaccine-to-control-a-pandemic/",
      "author_profiles": {
        "Ajao-olarinoye, M.": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/"
      },
      "crawled_from_author": "Michael Ajao-olarinoye",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
      "crawled_at": "2026-01-22T06:01:38.199459"
    },
    {
      "title": "A question-answering framework for automated abstract screening using large language models",
      "authors": [
        "Akinseloyin, O.",
        "Palade, V."
      ],
      "year": "2024",
      "abstract": "Objective: This paper aims to address the challenges in abstract screening within systematic reviews (SR) by leveraging the zero-shot capabilities of large language models (LLMs).Methods: We employ LLM to prioritize candidate studies by aligning abstracts with the selection criteria outlined in an SR protocol. Abstract screening was transformed into a novel question-answering (QA) framework, treating each selection criterion as a question addressed by LLM. The framework involves breaking down the selection criteria into multiple questions, properly prompting LLM to answer each question, scoring and re-ranking each answer, and combining the responses to make nuanced inclusion or exclusion decisions.Results and Discussion: Large-scale validation was performed on the benchmark of CLEF eHealth 2019 Task 2: Technology-Assisted Reviews in Empirical Medicine. Focusing on GPT-3.5 as a case study, the proposed QA framework consistently exhibited a clear advantage over traditional information retrieval approaches and bespoke BERT-family models that were fine-tuned for prioritizing candidate studies (ie, from the BERT to PubMedBERT) across 31 datasets of 4 categories of SRs, underscoring their high potential in facilitating abstract screening. The experiments also showcased the viability of using selection criteria as a query for reference prioritization. The experiments also showcased the viability of the framework using different LLMs.Conclusion: Investigation justified the indispensable value of leveraging selection criteria to improve the performance of automated abstract screening. LLMs demonstrated proficiency in prioritizing candidate studies for abstract screening using the proposed QA framework. Significant performance improvements were obtained by re-ranking answers using the semantic alignment between abstracts and selection criteria. This further highlighted the pertinence of utilizing selection criteria to enhance abstract screening.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-question-answering-framework-for-automated-abstract-screening-u/",
      "author_profiles": {
        "Akinseloyin, O.": "https://pureportal.coventry.ac.uk/en/persons/opeoluwa-akinseloyin/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Opeoluwa Akinseloyin",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/opeoluwa-akinseloyin/",
      "crawled_at": "2026-01-22T06:01:51.923993"
    },
    {
      "title": "Performance Analysis of Entropy Methods in Detecting Epileptic Seizure from Surface Electroencephalograms",
      "authors": [
        "Ali, E."
      ],
      "year": "2021",
      "abstract": "Physiological signals like Electrocardiography (ECG) and Electroencephalography (EEG) are complex and nonlinear in nature. To retrieve diagnostic information from these, we need the help of nonlinear methods of analysis. Entropy estimation is a very popular approach in the nonlinear category, where entropy estimates are used as features for signal classification and analysis. In this study, we analyze and compare the performances of four entropy methods; namely Distribution entropy (DistEn), Shannon entropy (ShanEn), Renyi entropy (RenEn) and LempelZiv complexity (LempelZiv) as classification features to detect epileptic seizure (ES) from surface Electroencephalography (sEEG) signal. Experiments were conducted on sEEG data from 23 subjects, obtained from the CHB-MIT database of PhysioNet. ShanEn, RenEn and LempelZiv entropy are found to be potential features for accurate and consistent detection of ES from sEEG, across multiple channels and subjects.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/performance-analysis-of-entropy-methods-in-detecting-epileptic-se/",
      "author_profiles": {
        "Ali, E.": "https://pureportal.coventry.ac.uk/en/persons/emran-ali/"
      },
      "crawled_from_author": "Emran Ali",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/emran-ali/",
      "crawled_at": "2026-01-22T06:02:05.369647"
    },
    {
      "title": "Exploiting Domain Structures in Heuristic Algorithms for the Set Covering Problem: A Literature Review",
      "authors": [
        "Babatunde, A."
      ],
      "year": "2022",
      "abstract": "This review aims at understanding the set covering problem (SCP) as an NP-hard problem, the variants of SCP, the methods that have been proposed to solve the problem, and gaps in the existing solutions that have been provided which need further research. A polynomial time algorithm to give an optimal solution to the Set Covering Problem is only possible if P=NP and so we do not expect to find such an algorithm. Instead, various heuristic algorithms have been used in an attempt to find an optimal solution for the problem. Exploring these types of algorithms provides solutions that are usable, or near optimal, but not exact which reduces the computational cost for the set covering problem. A comparison of metaheuristic algorithms and optimization of these algorithms is explored in this review",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/exploiting-domain-structures-in-heuristic-algorithms-for-the-set-/",
      "author_profiles": {
        "Babatunde, A.": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/"
      },
      "crawled_from_author": "Abiola Babatunde",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
      "crawled_at": "2026-01-22T06:02:32.377441"
    },
    {
      "title": "SCPR_Codes",
      "authors": [
        "Babatunde, A. T.",
        "SadeghiManesh, A.",
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/scprcodes/",
      "author_profiles": {
        "Babatunde, A. T.": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
        "SadeghiManesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Abiola Babatunde",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
      "crawled_at": "2026-01-22T06:02:39.516820"
    },
    {
      "title": "Supplementary_Files_For_SCPR",
      "authors": [
        "Babatunde, A. T.",
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/supplementaryfilesforscpr/",
      "author_profiles": {
        "Babatunde, A. T.": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Abiola Babatunde",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
      "crawled_at": "2026-01-22T06:02:46.019451"
    },
    {
      "title": "Symbolic Integration Algorithm Selection with Machine Learning: LSTMs vs Tree LSTMs",
      "authors": [
        "Barket, R.",
        "England, M."
      ],
      "year": "2024",
      "abstract": "Computer Algebra Systems (e.g. Maple) are used in research, education, and industrial settings. One of their key functionalities is symbolic integration, where there are many sub-algorithms to choose from that can affect the form of the output integral, and the runtime. Choosing the right sub-algorithm for a given problem is challenging: we hypothesise that Machine Learning can guide this sub-algorithm choice. A key consideration of our methodology is how to represent the mathematics to the ML model: we hypothesise that a representation which encodes the tree structure of mathematical expressions would be well suited. We trained both an LSTM and a TreeLSTM model for sub-algorithm prediction and compared them to Maple's existing approach. Our TreeLSTM performs much better than the LSTM, highlighting the benefit of using an informed representation of mathematical expressions. It is able to produce better outputs than Maple's current state-of-the-art meta-algorithm, giving a strong basis for further research.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/symbolic-integration-algorithm-selection-with-machine-learning-ls/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:06.392046"
    },
    {
      "title": "The Liouville Generator for Producing Integrable Expressions",
      "authors": [
        "Barket, R.",
        "England, M."
      ],
      "year": "2024",
      "abstract": "There has been a growing need to devise processes that can create comprehensive datasets in the world of Computer Algebra, both for accurate benchmarking and for new intersections with machine learning technology. We present here a method to generate integrands that are guaranteed to be integrable, dubbed the LIOUVILLE method. It is based on Liouville's theorem and the Parallel Risch Algorithm for symbolic integration. We show that this data generation method retains the best qualities of previous data generation methods, while overcoming some of the issues built into that prior work. The LIOUVILLE generator is able to generate sufficiently complex and realistic integrands, and could be used for benchmarking or machine learning training tasks related to symbolic integration.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-liouville-generator-for-producing-integrable-expressions/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:18.413868"
    },
    {
      "title": "Transformers to Predict the Applicability of Symbolic Integration Routines",
      "authors": [
        "Barket, R.",
        "Shafiq, U.",
        "England, M."
      ],
      "year": "2024",
      "abstract": "Symbolic integration is a fundamental problem in mathematics: we consider how machine learning may be used to optimise this task in a Computer Algebra System (CAS). We train transformers that predict whether a particular integration method will be successful, and compare against the existing human-made heuristics (called guards) that perform this task in a leading CAS. We find the transformer can outperform these guards, gaining up to 30% accuracy and 70% precision. We further show that the inference time of the transformer is inconsequential which shows that it is well-suited to include as a guard in a CAS. Furthermore, we use Layer Integrated Gradients to interpret the decisions that the transformer is making. If guided by a subject-matter expert, the technique can explain some of the predictions based on the input tokens, which can lead to further optimisations.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/transformers-to-predict-the-applicability-of-symbolic-integration/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
        "Shafiq, U.": "https://pureportal.coventry.ac.uk/en/persons/uzma-shafiq/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:25.148881"
    },
    {
      "title": "Generating Elementary Integrable Expressions",
      "authors": [
        "Barket, R.",
        "England, M."
      ],
      "year": "2023",
      "abstract": "There has been an increasing number of applications of machine learning to the field of Computer Algebra in recent years, including to the prominent sub-field of Symbolic Integration. However, machine learning models require an abundance of data for them to be successful and there exist few benchmarks on the scale required. While methods to generate new data already exist, they are flawed in several ways which may lead to bias in machine learning models trained upon them. In this paper, we describe how to use the Risch Algorithm for symbolic integration to create a dataset of elementary integrable expressions. Further, we show that data generated this way alleviates some of the flaws found in earlier methods.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/generating-elementary-integrable-expressions/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:31.995473"
    },
    {
      "title": "Framework for Generating Integrable Expressions",
      "authors": [
        "Barket, R."
      ],
      "year": "2022",
      "abstract": "Applications of machine learning are becoming more prominent in the field of computer algebra. Examples of such applications include selecting S-pairs in Buchberger’s algorithm or solving integrals and differential equations directly. With many of these applications, data must be generated to train a model. Methods such as generating binary trees representing mathematical expressions or created randomly in a recursive manner from a set of available function symbols, variables and constants have been discussed. However, these generated expressions do not represent a realistic dataset that draws from the typical Maple user’s experience.I propose a framework for generating valid mathematical expressions. More precisely, the focus will be on integrable expressions. The difference from other methods lies in the fact that the data generation method will be based on a test suite of data generated from Maple users. Thus, the new synthetic data will have properties similar to integrable expressions that Maple users would typically try. This data generation method will be used to train machine learning models that make efficient choices algorithm selection problems.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/framework-for-generating-integrable-expressions/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:38.674689"
    },
    {
      "title": "Dataset for Transformers to Predict the Applicability of Symbolic Integration Routines",
      "authors": [
        "Barket, R."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/dataset-for-transformers-to-predict-the-applicability-of-symbolic/",
      "author_profiles": {
        "Barket, R.": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/"
      },
      "crawled_from_author": "Rashid Barket",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
      "crawled_at": "2026-01-22T06:03:45.507461"
    },
    {
      "title": "Enhancing Science & Innovation Capacity of Vietnam for Sustainable Development",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/enhancing-science-innovation-capacity-of-vietnam-for-sustainable-/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:03:59.871622"
    },
    {
      "title": "Sustainable and Replicable Off-grid Renewable Energy System for Riverside Communities in the Amazon, Brazil (STAR Energy)",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/sustainable-and-replicable-off-grid-renewable-energy-system-for-r/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:06.463578"
    },
    {
      "title": "Philippines UK coLlaborative Partnership-System for Environmental and Efficient Drying",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/philippines-uk-collaborative-partnership-system-for-environmental/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:13.272326"
    },
    {
      "title": "Jaguar Land Rover: STRIVE: Machine learning for thermal comfort",
      "authors": [
        "Brusey, J.",
        "Thake, D.",
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/jaguar-land-rover-strive-machine-learning-for-thermal-comfort/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Thake, D.": "https://pureportal.coventry.ac.uk/en/persons/doug-thake/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:20.265523"
    },
    {
      "title": "Salford Uni / DECC: Passive house comfort monitoring",
      "authors": [
        "Brusey, J.",
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/salford-uni-decc-passive-house-comfort-monitoring/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:26.801496"
    },
    {
      "title": "Differential radial basis function network for sequence modelling",
      "authors": [
        "Brusey, J.",
        "Gaura, E."
      ],
      "year": "2022",
      "abstract": "We propose a differential radial basis function (RBF) network termed RBF-DiffNet—whose hidden layer blocks are partial differential equations (PDEs) linear in terms of the RBF—to make the baseline RBF network robust to noise in sequential data. Assuming that the sequential data derives from the discretisation of the solution to an underlying PDE, the differential RBF network learns constant linear coefficients of the PDE, consequently regularising the RBF network by following modified backward-Euler updates. We experimentally validate the differential RBF network on the logistic map chaotic timeseries as well as on 30 real-world timeseries provided by Walmart in the M5 forecasting competition. The proposed model is compared with the normalised and unnormalised RBF networks, ARIMA, and ensembles of multilayer perceptrons (MLPs) and recurrent networks with long short-term memory (LSTM) blocks. From the experimental results, RBF-DiffNet consistently shows a marked reduction in the prediction error over the baseline RBF network (e.g., 41% reduction in the root mean squared scaled error on the M5 dataset, and 53% reduction in the mean absolute error on the logistic map); RBF-DiffNet also shows a comparable performance to the LSTM ensemble but requires 99% less computational time. Our proposed network consequently enables more accurate predictions—in the presence of observational noise—in sequence modelling tasks such as timeseries forecasting that leverage the model interpretability, fast training, and function approximation properties of the RBF network.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/differential-radial-basis-function-network-for-sequence-modelling/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:45.632833"
    },
    {
      "title": "Fast, detailed, accurate simulation of a thermal car-cabin using machine-learning",
      "authors": [
        "Brusey, J.",
        "Gaura, E."
      ],
      "year": "2022",
      "abstract": "Car-cabin thermal systems, including heated seats, air-conditioning, and radiant panels, use a large proportion of the energy budget of electric vehicles and thus reduce their effective range. Optimising these systems and their controllers might be possible with computationally efficient simulation. Unfortunately, state-of-the-art simulators are either too slow or provide little resolution of the cabin's thermal environment. In this work, we propose a novel approach to developing a fast simulation by machine learning (ML) from measurements within the car cabin over a number of trials within a climatic wind tunnel. A range of ML approaches are tried and compared. The best-performing ML approach is compared to more traditional 1D simulation in terms of accuracy and speed. The resulting simulation, based on Multivariate Linear Regression, is fast (5 microseconds per simulation second), and yields good accuracy (NRMSE 1.8%), which exceeds the performance of the traditional 1D simulator. Furthermore, the simulation is able to differentially simulate the thermal environment of the footwell versus the head and the driver position versus the front passenger seat, but unlike a traditional 1D model cannot support changes to the physical structure.This fast method for obtaining computationally efficient simulators of car cabins will accelerate adoption of techniques such as Deep Reinforcement Learning for climate control.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/fast-detailed-accurate-simulation-of-a-thermal-car-cabin-using-ma/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:52.520032"
    },
    {
      "title": "Off the boil? The challenges of monitoring cooking behaviour in refugee settlements",
      "authors": [
        "Halford, A.",
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "2022",
      "abstract": "To address the need for improved access to energy and meet the United Nations Clean Energy Challenge (2019), humanitarian agencies require robust, valid, and meaningful data that documents the everyday energy practices of displaced people. Collecting data through sensor monitoring is one way of providing quality energy data that will aid humanitarian actors in designing and delivering sustainable affordable energy solutions. Using the case of the design and deployment of 20 stove use monitors (SUM) in Kigeme refugee camp in Rwanda, this paper discusses the benefits and limitations of collecting data on cookstove usage using wireless sensors in refugee settlements., Central to the discussion is the value of reflexivity or critical reflection to uncover significant knowledge gaps that can apply more generally to the problem of designing and deploying sensor systems for the displaced setting. If sensor monitoring systems are to collect data that aid appropriate energy planning and support technology development in the humanitarian sector, we contend improvements in sensor design and deployment protocols are needed to accommodate the displaced setting's cultural, economic, and political complexity. These improvements include the uptake of sensor monitoring design that embeds ethical, progressive, and inclusive protocols when working in the displaced setting.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/off-the-boil-the-challenges-of-monitoring-cooking-behaviour-in-re/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:04:59.217620"
    },
    {
      "title": "EPSRC HEED Data Repository: Stove Use Monitoring System",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-heed-data-repository-stove-use-monitoring-system/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:06.548467"
    },
    {
      "title": "EPSRC HEED Data Repository: Individual Appliance Monitoring System",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-heed-data-repository-individual-appliance-monitoring-system/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:13.044906"
    },
    {
      "title": "EPSRC HEED Data Repository: Footfall Monitoring System",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-heed-data-repository-footfall-monitoring-system/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:19.520746"
    },
    {
      "title": "EPSRC HEED Data Repository: Lantern Monitoring System",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-heed-data-repository-lantern-monitoring-system/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:26.038490"
    },
    {
      "title": "EPSRC HEED Data Repository: Nepal Household Appliance Survey",
      "authors": [
        "Gaura, E.",
        "Brusey, J.",
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-heed-data-repository-nepal-household-appliance-survey/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:32.628062"
    },
    {
      "title": "Practical Framework for Opportunistic Direct Interconnection between Wireless Sensor Networks with Native Communication Protocols",
      "authors": [
        "Brusey, J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/practical-framework-for-opportunistic-direct-interconnection-betw/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:39.087488"
    },
    {
      "title": "ComSE 2016, British Council Workshop",
      "authors": [
        "Gaura, E.",
        "Brusey, J."
      ],
      "year": "2016",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/comse-2016-british-council-workshop-2/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:46.100582"
    },
    {
      "title": "International Conference on Intelligent and Interactive Computing",
      "authors": [
        "Brusey, J."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/international-conference-on-intelligent-and-interactive-computing/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:53.348515"
    },
    {
      "title": "7th EVI-GTI International Gas Turbine Instrumentation Conference",
      "authors": [
        "Brusey, J."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/7th-evi-gti-international-gas-turbine-instrumentation-conference/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:05:59.766610"
    },
    {
      "title": "OPTIM",
      "authors": [
        "Brusey, J."
      ],
      "year": "2014",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/optim/",
      "author_profiles": {
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/"
      },
      "crawled_from_author": "James Brusey",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
      "crawled_at": "2026-01-22T06:06:06.209004"
    },
    {
      "title": "British Council MRes scholars - Women in STEM",
      "authors": [
        "Halford, A.",
        "England, M.",
        "Bhagat, R."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/british-council-mres-scholars-women-in-stem/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
        "Bhagat, R.": "https://pureportal.coventry.ac.uk/en/persons/rohit-bhagat/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:06:45.687257"
    },
    {
      "title": "An iterated greedy algorithm with variable reconstruction size for the obnoxious p-median problem",
      "authors": [
        "England, M."
      ],
      "year": "2025",
      "abstract": "The obnoxious p-median problem is a facility location problem where we maximise the sum of the distances between each client point and its nearest facility. Since it is nondeterministic polynomial-time (NP)-hard, most algorithms designed for the problem follow metaheuristic strategies to find high-quality solutions in affordable time but with no optimality guarantee. In this paper, a variant of the iterated greedy algorithm is developed for the problem. It adopts the idea of increasing the search radius used in variable neighbourhood search by increasing the number of reconstructed components at each iteration with no improved solution, where the amount of the increase is determined dynamically based on the quality of the current solution. We demonstrate that the new algorithm significantly outperforms the current state-of-the-art metaheuristic algorithms for this problem on standard datasets.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-iterated-greedy-algorithm-with-variable-reconstruction-size-fo/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:06:52.204343"
    },
    {
      "title": "Iterated Resultants and Rational Functions in Real Quantifier Elimination",
      "authors": [
        "England, M."
      ],
      "year": "2025",
      "abstract": "This paper builds and extends on the authors' previous work related to the algorithmic tool, Cylindrical Algebraic Decomposition (CAD), and one of its core applications, Real Quantifier Elimination (QE). These topics are at the heart of symbolic computation and were first implemented in computer algebra systems decades ago, but have recently received renewed interest as part of the ongoing development of SMT solvers for non-linear real arithmetic.First, we consider the use of iterated univariate resultants in traditional CAD, and how this leads to inefficiencies, especially in the case of an input with multiple equational constraints. We reproduce the workshop paper [Davenport & England, 2023], adding important clarifications to our suggestions first made there to make use of multivariate resultants in the projection phase of CAD. We then consider an alternative approach to this problem first documented in [McCallum & Brown, 2009] which redefines the actual object under construction, albeit only in the case of two equational constraints. We correct an unhelpful typo and provide a proof missing from that paper.We finish by revising the topic of how to deal with SMT or Real QE problems expressed using rational functions (as opposed to the usual polynomial ones) noting that these are often found in industrial applications. We revisit a proposal made in [Uncu, Davenport and England, 2023] for doing this in the case of satisfiability, explaining why such an approach does not trivially extend to more complicated quantification structure and giving a suitable alternative.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/iterated-resultants-and-rational-functions-in-real-quantifier-eli/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:06:58.873652"
    },
    {
      "title": "On Projective Delineability",
      "authors": [
        "England, M."
      ],
      "year": "2025",
      "abstract": "We are concerned with Cylindrical Algebraic Decomposition (CAD) and the key concept of delineability which underpins much CAD theory. We introduce a novel concept of projective delineability: a condition that is weaker and easier to guarantee computationally. We prove results on this new concept which can be used to reduce CAD computations.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/on-projective-delineability/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:05.652673"
    },
    {
      "title": "Predicting At-Risk Programming Students in Small Imbalanced Datasets using Synthetic Data",
      "authors": [
        "Flood, D.",
        "England, M.",
        "Grawemeyer, B."
      ],
      "year": "2025",
      "abstract": "This study is part of a larger project focused on measuring, understanding, and improving student engagement in programming education. We investigate whether synthetic data generation can help identify at-risk students earlier in a small, imbalanced dataset from an introductory programming module. The analysis used anonymised records from 379 students, with 15% marked as failing, and applied several machine learning algorithms. The first experiments showed poor recall for the failing group. However, using synthetic data generation methods led to a significant improvement in performance. Our results suggest that, when combined with synthetic data, machine learning can help identify at-risk students early in programming courses. This research lays the groundwork for validating and using these models with live student cohorts in the future, to allow for timely and effective interventions that can improve student outcomes. It also includes feature importance analysis to refine formative tasks. Overall, this study contributes to developing practical workflows that help detect disengagement early and improve student success in programming education.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/predicting-at-risk-programming-students-in-small-imbalanced-datas/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
        "Grawemeyer, B.": "https://pureportal.coventry.ac.uk/en/persons/beate-grawemeyer/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:12.246287"
    },
    {
      "title": "Projective Delineability for Single Cell Construction.",
      "authors": [
        "England, M."
      ],
      "year": "2025",
      "abstract": "The cylindrical algebraic decomposition (CAD) is the only complete method used in practice for solving problems like quantifier elimination or SMT solving related to real algebra, despite its doubly exponential complexity. Recent exploration-guided algorithms like NLSAT, NuCAD, and CAlC rely on CAD technology but reduce the computational effort heuristically. Single cell construction is a paradigm that is used in each of these algorithms. The central property on which the CAD algorithm is based is called delineability. Recently, we introduced a weaker notion called projective delineability which can require fewer computations to guarantee, but needs to be applied carefully. This paper adapts the single cell construction for exploiting projective delineability and reports on experimental results.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/projective-delineability-for-single-cell-construction/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:18.860847"
    },
    {
      "title": "A machine learning based software pipeline to pick the variable ordering for algorithms with polynomial inputs",
      "authors": [
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/a-machine-learning-based-software-pipeline-to-pick-the-variable-o/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:25.681284"
    },
    {
      "title": "Datset of automated economic reasoning problems for QE / SMT",
      "authors": [
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/datset-of-automated-economic-reasoning-problems-for-qe-smt/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:32.166618"
    },
    {
      "title": "Dataset supporting the paper: \"A Case Study on the Parametric Occurrence of Multiple Steady States\"",
      "authors": [
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/dataset-supporting-the-paper-a-case-study-on-the-parametric-occur/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:38.659204"
    },
    {
      "title": "Software supporting the paper: \"Comparing machine learning models to choose the variable ordering for cylindrical algebraic decomposition\"",
      "authors": [
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/software-supporting-the-paper-comparing-machine-learning-models-t/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:46.123747"
    },
    {
      "title": "SMT-Solving Induction Proofs of Inequalities Benchmarking Repository",
      "authors": [
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/smt-solving-induction-proofs-of-inequalities-benchmarking-reposit/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:53.134521"
    },
    {
      "title": "International Symposium on Symbolic Computation in Software Science",
      "authors": [
        "England, M."
      ],
      "year": "2016",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/international-symposium-on-symbolic-computation-in-software-scien/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:07:59.603055"
    },
    {
      "title": "International Workshop on Computer Algebra in Scientific Computing",
      "authors": [
        "England, M."
      ],
      "year": "2016",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/international-workshop-on-computer-algebra-in-scientific-computin/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:08:06.078918"
    },
    {
      "title": "40th International Symposium on Symbolic and Algebraic Computation (ISSAC)",
      "authors": [
        "England, M."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/40th-international-symposium-on-symbolic-and-algebraic-computatio/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:08:12.500116"
    },
    {
      "title": "Conferences on Intelligent Computer Mathematics",
      "authors": [
        "England, M."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/conferences-on-intelligent-computer-mathematics/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:08:18.900560"
    },
    {
      "title": "International Symposium on Symbolic and Numeric Algorithms for Scientific Computing",
      "authors": [
        "England, M."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/international-symposium-on-symbolic-and-numeric-algorithms-for-sc/",
      "author_profiles": {
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Matthew England",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
      "crawled_at": "2026-01-22T06:08:25.325237"
    },
    {
      "title": "Application of Amazon Web Services within teaching & learning at Coventry University Group",
      "authors": [
        "Flood, D."
      ],
      "year": "2022",
      "abstract": "Since September 2020, CU Group offers a Cloud Computing BSc(Hons) degree program developed with support from Amazon Web Services (AWS), leveraging their platform for teaching and learning and building upon their Cloud Competency Framework (CCF). This paper seeks to share how industry cloud technology stacks can be employed within authentic student learning. This has ensured a scenario led assessment for learning approach as an alternative to a simulated learning environment. CU Group is also an AWS Academy and Educate member, facilitating certification and platform access. This incorporates the experience of an industry leader in direct collaboration with HE to embed cloud skills within existing programs or develop specific curricula to target-fill skill gaps within the cloud landscape. Current students will graduate in August 2022, the first degree level graduates globally for HEIs working within the CCF.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/application-of-amazon-web-services-within-teaching-amp-learning-a/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/"
      },
      "crawled_from_author": "Dan Flood, MA BSc(Hons) FHEA",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
      "crawled_at": "2026-01-22T06:08:44.908901"
    },
    {
      "title": "AWS Summit 2022- Digital Skills: Creating Opportunity for All",
      "authors": [
        "Flood, D."
      ],
      "year": "2022",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/aws-summit-2022-digital-skills-creating-opportunity-for-all/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/"
      },
      "crawled_from_author": "Dan Flood, MA BSc(Hons) FHEA",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
      "crawled_at": "2026-01-22T06:08:51.491662"
    },
    {
      "title": "BETT 2022 Conference: Higher Education and pathwaying students into employment",
      "authors": [
        "Flood, D."
      ],
      "year": "2022",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/bett-2022-conference-higher-education-and-pathwaying-students-int/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/"
      },
      "crawled_from_author": "Dan Flood, MA BSc(Hons) FHEA",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
      "crawled_at": "2026-01-22T06:08:58.518667"
    },
    {
      "title": "CanvasCon Online 2020: AWS Educate at CU Coventry",
      "authors": [
        "Flood, D."
      ],
      "year": "2020",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/canvascon-online-2020-aws-educate-at-cu-coventry/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/"
      },
      "crawled_from_author": "Dan Flood, MA BSc(Hons) FHEA",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
      "crawled_at": "2026-01-22T06:09:04.920234"
    },
    {
      "title": "Coventry University Group Empowers Next Generation of IT Professionals Using AWS Educate and AWS Academy",
      "authors": [
        "Flood, D."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/coventry-university-group-empowers-next-generation-of-it-professi/",
      "author_profiles": {
        "Flood, D.": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/"
      },
      "crawled_from_author": "Dan Flood, MA BSc(Hons) FHEA",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
      "crawled_at": "2026-01-22T06:09:11.373540"
    },
    {
      "title": "Gene Regulatory Network Inference through Link Prediction using Graph Neural Network",
      "authors": [
        "Ganeshamoorthy, S.",
        "Roden, L.",
        "He, F."
      ],
      "year": "2023",
      "abstract": "Gene Regulatory Networks (GRNs) depict the causal regulatory interactions between transcription factors (TFs) and their target genes [2], where TFs are proteins that regulate gene transcription. GRN plays a vital role in explaining gene function, which helps to identify and prioritize the candidate genes for functional analysis [3]. Currently, high-dimensional transcriptome datasets are produced from high-throughput sequencing techniques, such as microarray and RNA-Seq. These techniques can capture the differences in the expression of thousands of genes at once. Through these wet-lab experiments, studying the interconnections among a large number of genes or TFs at a network level is challenging [4]. Therefore, one of the important topics in computational biology is the inference of GRNs from high-dimensional gene expression data through statistical and machine learning approaches [2].",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/gene-regulatory-network-inference-through-link-prediction-using-g/",
      "author_profiles": {
        "Ganeshamoorthy, S.": "https://pureportal.coventry.ac.uk/en/persons/sivasharmini-ganeshamoorthy/",
        "Roden, L.": "https://pureportal.coventry.ac.uk/en/persons/laura-roden/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Sivasharmini Ganeshamoorthy",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/sivasharmini-ganeshamoorthy/",
      "crawled_at": "2026-01-22T06:09:24.899262"
    },
    {
      "title": "Humanitarian, Engineering and Energy for Displacement (HEED)",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/humanitarian-engineering-and-energy-for-displacement-heed/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:09:39.231370"
    },
    {
      "title": "UKIERI-4: Leadership Development Programme for Women",
      "authors": [
        "Halford, A.",
        "Cheruvallil-Contractor, S.",
        "Ayoubi, R.",
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/ukieri-4-leadership-development-programme-for-women/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Cheruvallil-Contractor, S.": "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor/",
        "Ayoubi, R.": "https://pureportal.coventry.ac.uk/en/persons/rami-ayoubi/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:09:46.398773"
    },
    {
      "title": "Commission on Higher Education in partnership with the British Council",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/commission-on-higher-education-in-partnership-with-the-british-co/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:09:52.963998"
    },
    {
      "title": "Energy Revolution Research Consortium",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/energy-revolution-research-consortium/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:06.248864"
    },
    {
      "title": "Roadmap to reach global net-zero emissions for developing regions by 2085",
      "authors": [
        "Gaura, E."
      ],
      "year": "2025",
      "abstract": "As climate change intensifies, determining a developing region's role in achieving net-zero emissions worldwide is crucial. However, regional efforts, considering historical emissions, remain underexplored. Here, we assess energy system changes, technology adoption, and investments needed for developing regions, including five major- and minor-emitting nations. Our analysis, using an integrated assessment model, shows a large gap in regional efforts toward global net-zero emissions, stemming from the necessary shift of energy systems to low-carbon resources. The use of new technologies, like electric vehicles, hydrogen, and carbon capture, varies by region, with the highest adoption required between 2020 and 2030. Financing this shift needs an average gross domestic product (GDP) investment rise of 0.464% in minor-emitting regions and up to 2.1% in major-emitting regions by 2085. Our results could guide policies and support setting quantifiable targets for developing nations. The findings are key to facilitating strategic technology use and finance mobilization to achieve a carbon-neutral future.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/roadmap-to-reach-global-net-zero-emissions-for-developing-regions/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:12.842337"
    },
    {
      "title": "Unlocking the potential of sensors for our environment: A call to action from a NERC writing retreat",
      "authors": [
        "Gaura, E.",
        "Halford, A.",
        "Van De Wiel, M."
      ],
      "year": "2024",
      "abstract": "Funded by NERC Constructed for the Digital Environment, the report is a culmination of an intensive co-creation process and writing retreat that brought together experts in the field of environmental sensing to explore how to accelerate advancements in environmental sensing and sensor networks that acknowledge and respond to the interconnections between people, places, and ethics. The report emerges as a foundational document aimed at guiding future funding calls, stimulating innovation, and advocating for interdisciplinary research approaches.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/unlocking-the-potential-of-sensors-for-our-environment-a-call-to-/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Van De Wiel, M.": "https://pureportal.coventry.ac.uk/en/persons/marco-van-de-wiel/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:19.524091"
    },
    {
      "title": "Cyber-physical Advances in SLES: ​Resource pack for school workshop participants",
      "authors": [
        "Ingram, C.",
        "Halford, A.",
        "Gaura, E."
      ],
      "year": "2023",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/cyber-physical-advances-in-sles-resource-pack-for-school-workshop/",
      "author_profiles": {
        "Ingram, C.": "https://pureportal.coventry.ac.uk/en/persons/charlie-ingram/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:26.227006"
    },
    {
      "title": "The funding calls needed to advance the implementation of Smart Local Energy Systems.",
      "authors": [
        "Halford, A.",
        "Gaura, E."
      ],
      "year": "2023",
      "abstract": "This paper is the outcome of a workshop delivered as part of the Energy Revolution Research Consortium (EnergyREV) ‘Energy Smart Places: Insights from research and the challenges ahead’ summit held in March 2023, in London. Funded by the Prospering from the Energy Revolution (PFER) Industrial Strategy Challenge Fund, EnergyREV delivered research to accelerate the uptake and increase the value and impact of Smart Local Energy Systems (SLES). From 2019-2023, over 60 researchers from 22 UK Universities contributed multi-disciplinary expertise and delivered new tools and insights on infrastructure, policy, regulation, user engagement and digitalisation of energy systems to support whole-system integration of SLES.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-funding-calls-needed-to-advance-the-implementation-of-smart-l/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:33.172884"
    },
    {
      "title": "A community energy management system for smart microgrids",
      "authors": [
        "Gaura, E.",
        "Halford, A."
      ],
      "year": "2022",
      "abstract": "Community micro-grid energy projects are needed to drive de-carbonisation and increase equity of energy systems among displaced communities. However, micro-grid solutions are often inflexible and lack functionality to respond to displaced community energy needs and ensure the long-term sustainability of interventions. This paper explores the use of fog-computing retrofit architectures deployed on community micro-grid infrastructures to enable flexible demand management to improve service delivery and longevity. A micro-services solution is proposed that decouples components increasing resilience and testability while allowing hybrid edge-cloud deployments. The architecture is outlined and demonstrated for a micro-grid providing energy to two nurseries and a playground in Kigeme refugee camp, Rwanda. To enact the community priorities within the demand management system, modified Genetic Algorithm (GA) methods are outlined and tested for different use-case scenarios. The performance of the modified GA methods are then compared with a pre-existing battery protect controller and an alternative deterministic (space-shared) energy manager model. A modified search space GA method was required for GA to outperform both the existing battery controller and proposed deterministic method in terms of achieving the highest utility function in almost every use-case. The results further showed how simple community priorities can be set and used to enact control on the system in 24h timeframes that are in line with the local decision-making context.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-community-energy-management-system-for-smart-microgrids/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:10:40.058652"
    },
    {
      "title": "RENEWABLEMEET2022",
      "authors": [
        "Gaura, E."
      ],
      "year": "2022",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/renewablemeet2022/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:17.980654"
    },
    {
      "title": "EPSRC Centre for Doctoral Training in Sensor Technologies for a Healthy and Sustainable Future (External organisation)",
      "authors": [
        "Gaura, E."
      ],
      "year": "2021",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/epsrc-centre-for-doctoral-training-in-sensor-technologies-for-a-h/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:24.502148"
    },
    {
      "title": "UK Doctoral Training Alliance (DTA) (External organisation)",
      "authors": [
        "Gaura, E."
      ],
      "year": "2021",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/uk-doctoral-training-alliance-dta-external-organisation/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:31.263917"
    },
    {
      "title": "World Engineering Day",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/world-engineering-day/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:38.073658"
    },
    {
      "title": "Global Summit on Sensors and Sensing Technology",
      "authors": [
        "Gaura, E."
      ],
      "year": "2021",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/global-summit-on-sensors-and-sensing-technology/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:44.487093"
    },
    {
      "title": "Coventry University International Women’s Day award",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/coventry-university-international-womens-day-award/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:50.888639"
    },
    {
      "title": "Engineering Heroes – The 2021 Top 50 Women in Engineering #WE50",
      "authors": [
        "Gaura, E."
      ],
      "year": "2021",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/engineering-heroes-the-2021-top-50-women-in-engineering-we50/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:11:57.315616"
    },
    {
      "title": "Membership of Women's Engineering Society to celebrate centenary",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/membership-of-womens-engineering-society-to-celebrate-centenary/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:03.751230"
    },
    {
      "title": "Most Innovative Consultant",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/most-innovative-consultant/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:10.217594"
    },
    {
      "title": "Engineering Heroes",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/engineering-heroes/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:16.635833"
    },
    {
      "title": "Enhancing Science and Innovation Capacity of Vietnam for Sustainable Development",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/enhancing-science-and-innovation-capacity-of-vietnam-for-sustaina/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:23.055304"
    },
    {
      "title": "Ten Philippine higher education institutions to offer postgraduate programmes with partner UK universities",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/ten-philippine-higher-education-institutions-to-offer-postgraduat/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:29.508982"
    },
    {
      "title": "Bringing off-grid power to the Brazilian Amazon",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/bringing-off-grid-power-to-the-brazilian-amazon/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:35.937598"
    },
    {
      "title": "Diversifying India's STEM workforce: STEM Education Programme success story",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/clippings/diversifying-indias-stem-workforce-stem-education-programme-succe/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:42.402606"
    },
    {
      "title": "Neural Network Techniques for the Control and Identification of Acceleration Sensors",
      "authors": [
        "Gaura, E."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/studentTheses/neural-network-techniques-for-the-control-and-identification-of-a/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/"
      },
      "crawled_from_author": "Elena Gaura",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
      "crawled_at": "2026-01-22T06:12:48.829949"
    },
    {
      "title": "A community‑based entropic method to identify influential nodes across multiple social networks",
      "authors": [
        "Ghasemi, A."
      ],
      "year": "2025",
      "abstract": "Identifying influential nodes in social networks − by determining the most effective and efficient set of primary users − is acrucial task for maximizing the spread of influence. The competitive world of social networks and the variety of servicesthey provide have persuaded users to apply for the membership of several networks. This situation makes involvement ofthe shared individuals across multiple social networks essential for the effective dissemination of information. In this paper,we introduce a community-based entropic method to identify influential nodes in multiple social networks, taking intoaccount the effect of shared users. The proposed method, titled IM2-SE, focuses on calculating a total structural entropy foreach node. This structural entropy is defined as the weighted sum of the structural entropies of the node in the networks andin the communities, it belongs to. The structural entropy of a node is based on Tsallis entropy considering both local andglobal structures of the network, and it utilizes the degree of centrality and betweenness centrality. Then, the nodes with thehighest total structural entropy are identified as the influential nodes. The empirical evaluation of the proposed method onthe real-world datasets including homogeneous and heterogeneous networks, demonstrates its superior performance to thebaseline methods. Furthermore, the impact of the shared nodes between networks in identifying the influential nodes hasbeen examined, revealing that up to 50% of the identified influential nodes are the shared nodes between specific networks.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-communitybased-entropic-method-to-identify-influential-nodes-ac/",
      "author_profiles": {
        "Ghasemi, A.": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
      },
      "crawled_from_author": "Abdorasoul Ghasemi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
      "crawled_at": "2026-01-22T06:13:02.344262"
    },
    {
      "title": "Optimal Redundant Sensor Placement for Protection Blinding in Active Distribution Grids",
      "authors": [
        "Ghasemi, A."
      ],
      "year": "2025",
      "abstract": "Integrating renewable energy sources into the power distribution grid challenges protection system operation, leading to protection blinding when circuit breakers fail to trip due to fault current contribution from these sources. Communication-based adaptive protection can address this issue, but communication system components like sensors can fail. This research proposes a genetic algorithm-based approach to optimally place redundant sensors, minimizing protection blinding under communication uncertainty within a redundancy budget. The fault tolerance, measured by a new metric called redundancy degree, reflects the number of redundant components deployed. Results demonstrate the algorithm’s effectiveness in optimizing redundant sensor locations, reducing system costs, and improving fault tolerance. For the system and scenarios investigated, an average of 60% redundant sensors are relocated, reducing the average protection trip time by 36.65% compared to a baseline approach that does not consider communication uncertainty. This encourages incorporating communication component failure considerations in power system planning.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/optimal-redundant-sensor-placement-for-protection-blinding-in-act/",
      "author_profiles": {
        "Ghasemi, A.": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
      },
      "crawled_from_author": "Abdorasoul Ghasemi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
      "crawled_at": "2026-01-22T06:13:09.048568"
    },
    {
      "title": "Swarm Intelligence-Based Algorithm for Workload Placement in Edge-Fog-Cloud Continuum",
      "authors": [
        "Ghasemi, A."
      ],
      "year": "2025",
      "abstract": "This paper addresses the workload placement problem in the edge-fog-cloud continuum. We model the edge fog-cloud computing continuum as a multi-agent framework consisting of networked resource supply and demand agents. Inspired by the swarm intelligence behavior of the ant colony optimization, we propose a workload scheduler for the arriving demand agents to increase local resource utilization and reduce communication costs without relying on a centralized scheduler. Like the ants, the demand agents will release pheromones on the resource agent to indicate the available resources. The next arriving demand agent will most probably choose a neighbor, following the pheromone value and communication cost. The framework’s performance is evaluated in terms of local resource utilization, dependency on fog and cloud, and communication cost. We compare these metrics for the ant-inspired algorithm with random and greedy algorithms.The simulation results reveal that the proposed algorithm inspired by swarm intelligence can increase resource utilization at the edge and reduce the dependency on higher layers, while also decreasing the communication cost for the task of resource allocation",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/swarm-intelligence-based-algorithm-for-workload-placement-in-edge/",
      "author_profiles": {
        "Ghasemi, A.": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
      },
      "crawled_from_author": "Abdorasoul Ghasemi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
      "crawled_at": "2026-01-22T06:13:15.754492"
    },
    {
      "title": "Analysis of protection blinding in active distribution grids",
      "authors": [
        "Ghasemi, A."
      ],
      "year": "2024",
      "abstract": "Protection blinding is a challenging issue in renewables-penetrated distribution grids and refers to a situation where a circuit breaker may not trip due to fault current contribution from distributed generation. This research addresses how the distributed generation location and capacity impact the operation of the circuit breaker in terms of the response time of the circuit breakers. The relative electrical distances of the faults and distributed generation to the circuit breakers are considered. The impact of distributed generation capacity considering the fault location is characterized using a new index called the heterogeneity index. The electrical distance between distributed generations and circuit breakers and the electrical distance between fault and circuit breaker is considered by a second new index called the electrical distance ratio. Data analysis on simulation results shows that these indices capture the phenomena of protection blinding caused by distributed generation. Results show that a higher distributed generation penetration and faults that are electrically further away from a circuit breaker show severe cases of protection blinding captured by the indices. Furthermore, it is demonstrated how these indices can identify the worst impacted locations in the distribution grid. A key result is that protection blinding does not necessarily occur solely due to the presence of distributed generation between a circuit breaker and a fault, but is dependent on factors such as distributed generation location in the distribution grid, fault level, fault level distribution across the generation units and fault location.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/analysis-of-protection-blinding-in-active-distribution-grids/",
      "author_profiles": {
        "Ghasemi, A.": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
      },
      "crawled_from_author": "Abdorasoul Ghasemi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
      "crawled_at": "2026-01-22T06:13:22.411175"
    },
    {
      "title": "An Interaction-Dependent Model for Probabilistic Cascading Failure",
      "authors": [
        "Ghasemi, A."
      ],
      "year": "2024",
      "abstract": "We suggest interaction-CASCADE as a combined model by extending the CASCADE as a probabilistic high-level model to consider the underlying components’ failure interaction graph, which could be derived using detailed models. In interaction-CASCADE, the total incurred overload after each component failure is the same as the CASCADE; however, the overload transfers to the out neighbors of the failed component given by the interaction graph. We first assume that the component’s initial loads are independent of their out- and in-degrees in the interaction graph and show that even though the process’s dynamics depend on the interaction graphs’ structure, the critical load beyond which the probability of total failure is significant does not change. We then discuss that assigning the lighter loads to components with higher in-degrees can shift the minimum critical load to higher values. Simulation results for random Erdős-Rényi and power-law degree distributed are provided and discussed.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-interaction-dependent-model-forprobabilistic-cascading-failure/",
      "author_profiles": {
        "Ghasemi, A.": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/"
      },
      "crawled_from_author": "Abdorasoul Ghasemi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
      "crawled_at": "2026-01-22T06:13:29.059198"
    },
    {
      "title": "MSA-CNN: A Lightweight Multi-Scale CNN with Attention for Sleep Stage Classification",
      "authors": [
        "Goerttler, S.",
        "He, F."
      ],
      "year": "2025",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/msa-cnn-a-lightweight-multi-scale-cnn-with-attention-for-sleep-st/",
      "author_profiles": {
        "Goerttler, S.": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Stephan Goerttler",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
      "crawled_at": "2026-01-22T06:13:42.873542"
    },
    {
      "title": "Balancing Spectral, Temporal and Spatial Information for EEG-based Alzheimer’s Disease Classification",
      "authors": [
        "Goerttler, S.",
        "He, F."
      ],
      "year": "2024",
      "abstract": "The prospect of future treatment warrants the development of cost-effective screening for Alzheimer's disease (AD). A promising candidate in this regard is electroencephalography (EEG), as it is one of the most economic imaging modalities. Recent efforts in EEG analysis have shifted towards leveraging spatial information, employing novel frameworks such as graph signal processing or graph neural networks. Here, we investigate the importance of spatial information relative to spectral or temporal information by varying the proportion of each dimension for AD classification. To do so, we systematically test various dimension resolution configurations on two routine EEG datasets. Our findings show that spatial information is more important than temporal information and equally valuable as spectral information. On the larger second dataset, substituting spectral with spatial information even led to an increase of 1.1% in accuracy, which emphasises the importance of spatial information for EEG-based AD classification. We argue that our resolution-based feature extraction has the potential to improve AD classification specifically, and multivariate signal classification generally.Clinical relevance - This study proposes balancing the spectral, temporal and spatial feature resolution to improve EEGbased diagnosis of neurodegenerative diseases.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/balancing-spectral-temporal-and-spatial-information-for-eeg-based/",
      "author_profiles": {
        "Goerttler, S.": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Stephan Goerttler",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
      "crawled_at": "2026-01-22T06:13:49.667311"
    },
    {
      "title": "EEG-GMACN: Interpretable EEG Graph Mutual Attention Convolutional Network",
      "authors": [
        "Ye, H.",
        "Goerttler, S.",
        "He, F."
      ],
      "year": "2024",
      "abstract": "Electroencephalogram (EEG) is a valuable technique to record brain electrical activity through electrodes placed on the scalp. Analyzing EEG signals contributes to the understanding of neurological conditions and developing brain-computer interface. Graph Signal Processing (GSP) has emerged as a promising method for EEG spatial-temporal analysis, by further considering the topological relationships between electrodes. However, existing GSP studies lack interpretability of electrode importance and the credibility of prediction confidence. This work proposes an EEG Graph Mutual Attention Convolutional Network (EEG-GMACN), by introducing an ’Inverse Graph Weight Module’ to output interpretable electrode graph weights, enhancing the clinical credibility and interpretability of EEG classification results. Additionally, we incorporate a mutual attention mechanism module into the model to improve its capability to distinguish critical electrodes and introduce credibility calibration to assess the uncertainty of prediction results. This study enhances the transparency and effectiveness of EEG analysis, paving the way for its widespread use in clinical and neuroscience research.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/eeg-gmacn-interpretable-eeg-graph-mutual-attention-convolutional-/",
      "author_profiles": {
        "Ye, H.": "https://pureportal.coventry.ac.uk/en/persons/haili-ye/",
        "Goerttler, S.": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Stephan Goerttler",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
      "crawled_at": "2026-01-22T06:13:56.319847"
    },
    {
      "title": "Stochastic Graph Heat Modelling for Diffusion-based Connectivity Retrieval",
      "authors": [
        "Goerttler, S.",
        "He, F."
      ],
      "year": "2024",
      "abstract": "Heat diffusion describes the process by which heat flows from areas with higher temperatures to ones with lower temperatures. This concept was previously adapted to graph structures, whereby heat flows between nodes of a graph depending on the graph topology. Here, we combine the graph heat equation with the stochastic heat equation, which ultimately yields a model for multivariate time signals on a graph. We show theoretically how the model can be used to directly compute the diffusion-based connectivity structure from multivariate signals. Unlike other connectivity measures, our heat model-based approach is inherently multivariate and yields an absolute scaling factor, namely the graph thermal diffusivity, which captures the extent of heat-like graph propagation in the data. On two datasets, we show how the graph thermal diffusivity can be used to characterise Alzheimer’s disease (AD). We find that the graph thermal diffusivity is lower for AD patients than healthy controls and correlates with mini–mental state examination (MMSE) scores, suggesting structural impairment in patients in line with previous findings.Clinical relevance— This study introduces a novel heat-based connectivity measure, which allows to characterise Alzheimer’s disease in terms of the graph thermal diffusivity.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/stochastic-graph-heat-modelling-for-diffusion-based-connectivity-/",
      "author_profiles": {
        "Goerttler, S.": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Stephan Goerttler",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
      "crawled_at": "2026-01-22T06:14:02.990828"
    },
    {
      "title": "Understanding Concepts in Graph Signal Processing for Neurophysiological Signal Analysis",
      "authors": [
        "Goerttler, S.",
        "He, F."
      ],
      "year": "2024",
      "abstract": "Multivariate signals measured simultaneously over time by sensor networks are becoming increasingly common. The emerging field of graph signal processing (GSP) promises to analyse spectral characteristics of these multivariate signals, while also taking the spatial structure between the time signals into account. A core idea in GSP is the graph Fourier transform, which projects a multivariate signal onto frequency-ordered graph Fourier modes and can be regarded as a spatial analogue of the classical Fourier transform. This chapter derives and discusses key concepts in GSP, with a specific focus on understanding the differences between parallel formulations and the interconnections between the various concepts. The experimental section focuses on the role of graph frequency in data classification, with applications to neuroimaging. To shed light on graph frequencies individually, sample sizes larger than those of relevant empirical data sets are needed. We therefore introduce a minimalist simulation to generate sufficiently many signals, which share key characteristics with neurophysiological signals. Using this artificial data, we find that higher graph frequency signals are more suitable for classification as compared to lower graph frequency signals and propose GSP mechanisms to explain our findings. Finally, we present a baseline testing framework for GSP. Using this framework, our results suggest that GSP may be applicable for dimensionality reduction in neurophysiological signals.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/understanding-concepts-in-graph-signal-processing-for-neurophysio/",
      "author_profiles": {
        "Goerttler, S.": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Stephan Goerttler",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
      "crawled_at": "2026-01-22T06:14:09.623762"
    },
    {
      "title": "Kernel-based Nonlinear Manifold Learning for EEG Functional Connectivity Analysis with Application to Alzheimer's Disease",
      "authors": [
        "Gunawardena, S. R. A. S.",
        "He, F."
      ],
      "year": "2023",
      "abstract": "Dynamical, causal and cross-frequency coupling analysis using the EEG has received significant interest for the analysis and diagnosis of neurological disorders [1]–[3]. Due to the high computational requirements needed for some of these methods, EEG channel selection is crucial [4]. Functional connectivity (FC) between EEG channels is often used for channel selection and connectivity analysis [4, S, 6]. Ideally, in the case of selecting channels for dynamical and causal analysis, FC methods should be able to account for linear and nonlinear spatial and temporal interactions between EEG channels. In neuroscience, FC is quantified using different measures of (dis) similarity to assess the statistical dependence between two signals [5]. However, the interpretation of FC measures can differ significantly from one measure to another[5, 7]. In the early diagnosis of AD, [7] showed correlations among various (dis)similarity measures, and therefore these measures can be grouped. Thus, one from each is sufficient to extract information from the data [7]. Therefore, the development of a generic measure of (dis)similarity is important in FC analysis.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/kernel-based-nonlinear-manifold-learning-for-eeg-functional-conne/",
      "author_profiles": {
        "Gunawardena, S. R. A. S.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:23.505381"
    },
    {
      "title": "Fault Detection of Nonlinear Rotor-Bearing Systems by Using the Nonlinear Output Frequency Response Functions (NOFRFs)",
      "authors": [
        "Gunawardena, S. R. A. S."
      ],
      "year": "2018",
      "abstract": "In this study, the fault detection of nonlinear rotor-bearing systems is investigated by using the frequency analysis approach. The Nonlinear Output Frequency Response Functions (NOFRFs) of the nonlinear rotor-bearing system are evaluated and used to diagnosis the abnormal conditions of the bearings. Both simulation and experimental studies are conducted to demonstrate the application of the NOFRFs based fault detection method. The results indicate that the higher order NOFRFs are sensitive to the faults of the bearings and independent of the imbalance distance of the rotor. The monotonous change of the NOFRFs with the severity of the faults can be used to effectively quantify the severities of defects in the rotor-bearing systems.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/fault-detection-of-nonlinear-rotor-bearing-systems-by-using-the-n/",
      "author_profiles": {
        "Gunawardena, S. R. A. S.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:30.171617"
    },
    {
      "title": "An Effective Method for Evaluation of the Nonlinear Output Frequency Response Functions from System Input-Output Data",
      "authors": [
        "Gunawardena, S. R. A. S."
      ],
      "year": "2018",
      "abstract": "The concept of Nonlinear Output Frequency Response Functions (NOFRFs) was introduced in [1] for the analysis of nonlinear systems in the frequency domain where a least-squares (LS) method was proposed for the evaluation of the NOFRFs using system input-output data. However, this leastsquares (LS) based approach may experience numerical errors due to matrix inversion and consequently cannot produce accurate NOFRFs sometimes. In order to mitigate this problem, in the present study, a modified LS method (M-LS) is proposed to make sure that the information matrix to be inverted for the LS solution is appropriately constructed so as to improve the condition number of the information matrix and reduce the numerical errors. Simulation results have demonstrated the effectiveness of the newly proposed method and indicated that the new method will enable a more accurate evaluation of the NOFRFs and facilitate the frequency analysis of nonlinear systems directly using system input-output data.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-effective-method-for-evaluation-of-the-nonlinear-output-freque/",
      "author_profiles": {
        "Gunawardena, S. R. A. S.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:36.820847"
    },
    {
      "title": "Nonlinear Design and Optimisation of a Vibration Energy Harvester",
      "authors": [
        "Gunawardena, R."
      ],
      "year": "2018",
      "abstract": "Nonlinear behavior has been exploited over the last decade towards improving the efficiency of most engineering systems. The effect of nonlinearities on a vibration energy harvester (VEH) has been widely studied. It has been reported in literature that a cubic damping nonlinearity extends the dynamic range (power/energy level) of a VEH system. It has also been widely shown that the operational bandwidth of a VEH system can be increased using a nonlinear hardening spring. As most energy harvesters have a maximum throw limited by the physical enclosure of the device, it is imperative to improve the operational conditions of the harvester within this limitation. This paper investigates the effects of a nonlinear hardening spring with cubic damping on a VEH system while assuming no limitation to the maximum throw (Practical VEH systems are constrained to a maximum throw and this is considered in a subsequent study). A frequency-based approach known as Output Frequency Response Function (OFRF) determined using the Associated Linear Equations (ALEs) of the nonlinear system model is employed. The OFRF polynomial is a representation of the actual system model hence used for the nonlinear VEH analysis and design. Based on the OFRF, optimal parameter values are designed to achieve any desired level of energy for the VEH.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/nonlinear-design-and-optimisation-of-a-vibration-energy-harvester/",
      "author_profiles": {
        "Gunawardena, R.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:43.519249"
    },
    {
      "title": "Investigative Study of the Effect of Damping and Stiffness Nonlinearities on an Electromagnetic Energy Harvester at Low-Frequency Excitations",
      "authors": [
        "Gunawardena, R."
      ],
      "year": "2024",
      "abstract": "Ambient vibration energy is widely being harnessed as a source of electrical energy to drive low-power devices. The vibration energy harvester (VEH) of interest employs an electromagnetic transduction mechanism, whereby ambient mechanical vibration is converted to electrical energy. The limitations affecting the performance of VEHs, with an electromagnetic transduction structure, include its operational bandwidth as well as the enclosure-size constraint. In this study, an analysis and design of a nonlinear VEH system is conducted using the Output Frequency Response Function (OFRF) representations of the actual system model. However, the OFRF representations are determined from the Generalised Associated Linear Equation (GALE) decompositions of the system of interest. The effect of both nonlinear damping and stiffness characteristics, to, respectively, extend the average power and operational bandwidth of the VEH device, is demonstrated.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/investigative-study-of-the-effect-of-damping-and-stiffness-nonlin/",
      "author_profiles": {
        "Gunawardena, R.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:50.127207"
    },
    {
      "title": "A Nonlinear Manifold Learning & Dynamical System Approach in Characterising Alzheimer’s Disease",
      "authors": [
        "Gunawardena, R.",
        "He, F.",
        "England, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/studentTheses/a-nonlinear-manifold-learning-dynamical-system-approach-in-charac/",
      "author_profiles": {
        "Gunawardena, R.": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "Raj Gunawardena",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
      "crawled_at": "2026-01-22T06:14:57.337420"
    },
    {
      "title": "Solar Energy Transitions (SET): Inclusive e-cooking in sub-Saharan Africa [Innovate UK - Energy Catalyst Round 9]",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/solar-energy-transitions-set-inclusive-e-cooking-in-sub-saharan-a/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:23.312916"
    },
    {
      "title": "Uncovering the legacy of Black British Social Workers: Between the personal, the professional and the political",
      "authors": [
        "Cheruvallil-Contractor, S.",
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/uncovering-the-legacy-of-black-british-social-workers-between-the/",
      "author_profiles": {
        "Cheruvallil-Contractor, S.": "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:29.818636"
    },
    {
      "title": "NERC Constructing a Digital Environment Unlocking the potential of sensors for our environment: A co-creation and writing retreat",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/nerc-constructing-a-digital-environment-unlocking-the-potential-o/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:36.349303"
    },
    {
      "title": "The Black Social Workers’ Oral History Project: When heritage is powerful and political",
      "authors": [
        "Cheruvallil-Contractor, S.",
        "Halford, A."
      ],
      "year": "2025",
      "abstract": "Historically, SW practice has not always met Black children’s identity needs. In the 70s, it was standard practice to place Black children in white homes. In 2002, legal policy was amended to emphasize children's religion, race, and culture in finding permanent homes. However, in 2014 the legal requirement to consider ethnicity was removed, allowing transracial placements. Many frontline social workers did not agree with this change, arguing that by removing ethnicity, the law devalued the significance of ethnicity to individual children’s identity. Against this backdrop of policy U-turns, and funded by the National Lottery Heritage Fund, this heritage project explores Black SWs historical navigations around identity – how did they perceive and experience these changes?",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-black-social-workers-oral-history-project-when-heritage-is-po/",
      "author_profiles": {
        "Cheruvallil-Contractor, S.": "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:42.920861"
    },
    {
      "title": "“Your Lord has not forsaken you”: Interrogating Socio-Political and Theological Reasons for the lack of Adopters and Foster Carers from Muslim backgrounds in Britain",
      "authors": [
        "Cheruvallil-Contractor, S.",
        "Halford, A."
      ],
      "year": "2025",
      "abstract": "All children need permanent, caring and secure homes in which they can grow and thrive. There are more than 4500 Muslim-heritage children in the UK who cannot live with their biological families. For some of these children, ethnically and religiously matched homes can lead to more secure futures; however, there is a shortage of Muslim-heritage carers. This article examines the reasons for the lack of Muslim-heritage adopters or foster carers in the UK by combining understandings from Islamic religious texts, contemporary British social work practice, and sociological analysis of children's experiences. The empirical findings presented here are based on semi-structured qualitative interviews (n = 41) with various professionals and carers involved in the care of Muslim-heritage children. Our evidence uncovers specific socio-cultural, political and theological barriers that hinder carers of Muslim backgrounds from coming forward to adopt or foster. By better understanding these barriers, this article provides an evidence base to inform social work policy and practice to enhance recruitment of carers from Muslim backgrounds. The data presented in the paper also contributes to raising awareness within Social Work practice and Muslim communities around the needs of vulnerable children, to improve their life outcomes.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/your-lord-has-not-forsaken-you-interrogating-socio-political-and-/",
      "author_profiles": {
        "Cheruvallil-Contractor, S.": "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:49.782333"
    },
    {
      "title": "[Review of] Irish Mormonism: Reconciling Identity in Global Mormonism, by HAZEL O’BRIEN",
      "authors": [
        "Halford, A."
      ],
      "year": "2024",
      "abstract": "Review of Irish Mormonism: Reconciling Identity in Global Mormonism, by HAZEL O’BRIEN Get access ArrowIrish Mormonism: Reconciling Identity in Global Mormonism, by HAZEL O’BRIENChicago: University of Illinois Press, 2023, 209 pp.; $26.00.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/review-of-irish-mormonism-reconciling-identity-in-global-mormonis/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:15:56.437694"
    },
    {
      "title": "A Lifecycle Approach for Artificial Intelligence Ethics in Energy Systems",
      "authors": [
        "Halford, A.",
        "Stamp, K."
      ],
      "year": "2024",
      "abstract": "Despite the increasing prevalence of artificial intelligence (AI) ethics frameworks, the practical application of these frameworks in industrial settings remains limited. This limitation is further augmented in energy systems by the complexity of systems composition and systems operation for energy generation, distribution, and supply. The primary reason for this limitation is the gap between the conceptual notion of ethics principles and the technical performance of AI applications in energy systems. For instance, trust is featured prominently in ethics frameworks but pertains to limited relevance for the robust operation of a smart grid. In this paper, we propose a lifecycle approach for AI ethics that aims to address this gap. The proposed approach consists of four phases: design, development, operation, and evaluation. All four phases are supported by a central AI ethics repository that gathers and integrates the primary and secondary dimensions of ethical practice, including reliability, safety, and trustworthiness, from design through to evaluation. This lifecycle approach is closely aligned with the operational lifecycle of energy systems, from design and production through to use, maintenance, repair, and overhaul, followed by shutdown, recycling, and replacement. Across these lifecycle stages, an energy system engages with numerous human stakeholders, directly with designers, engineers, users, trainers, operators, and maintenance technicians, as well as indirectly with managers, owners, policymakers, and community groups. This lifecycle approach is empirically evaluated in the complex energy system of a multi-campus tertiary education institution where the alignment between ethics and technical performance, as well as the human-centric application of AI, are demonstrated.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-lifecycle-approach-for-artificial-intelligence-ethics-in-energy/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Stamp, K.": "https://pureportal.coventry.ac.uk/en/persons/kathryn-stamp/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:03.038654"
    },
    {
      "title": "Expressions of Self: Race, Religion and Representation of minoritised children and young people in the British Care System",
      "authors": [
        "Cheruvallil-Contractor, S.",
        "Halford, A."
      ],
      "year": "2024",
      "abstract": "This research report draws on original research to explore how care-experienced children and young people from minoritised backgrounds understand their identities. Through their narratives, we understand how children in care experience and perceive their identities, as well as their understandings of the care that they receive and desire for their identities.We rely on children’s and young people’s voices and stories. Using an intersectional approach, we worked with Black, Asian and mixed-heritage children and young people (aged 14 to 19) to understand their narratives of identity. We focused firstly on understandings of ethnicity and religion and how these change in relation to other aspects of identity and, crucially, by being in care. Secondly, we examined their experiences of asking and getting help from social workers, foster carers, adopters and other support structures that provide for their identities while in care.By listening to and understanding children and young people’s perspectives around ethnicity, religion and identity, we developed a new framework to inform both theoretical and practical work with children in care. We describe our model as Identities in-Flux, which integrates Kimberlé Crenshaw’s Intersectionality and Meredith McGuires’ Lived Religion theories to generate new frameworks of reference that support best practice when implementing support plans for young people and children. Within this model, we consider the interplay of changing socio-ethnic-religious factors, as well as young people and children’s biological heritage, their being in care and their own agency in determining how they themselves want to be perceived. By broadening discussion from a singular focus on one aspect of identity, such as race or gender, we hope to support inclusive and sensitive practices and policies that reflect and respond to the increasing diversity of children and young people entering care.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/expressions-of-self-race-religion-and-representation-of-minoritis/",
      "author_profiles": {
        "Cheruvallil-Contractor, S.": "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:10.208531"
    },
    {
      "title": "EPSRC-funded Humanitarian Engineering and Energy for Displacement (HEED) datasets",
      "authors": [
        "Gaura, E.",
        "Brusey, J.",
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/epsrc-funded-humanitarian-engineering-and-energy-for-displacement/",
      "author_profiles": {
        "Gaura, E.": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
        "Brusey, J.": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:23.161616"
    },
    {
      "title": "Survey Data from the SET Project",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/survey-data-from-the-set-project/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:29.627451"
    },
    {
      "title": "E-cooker system and metered data from the SET Project",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/e-cooker-system-and-metered-data-from-the-set-project/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:36.125230"
    },
    {
      "title": "Cookstove Data from Coventry University SET Project",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/cookstove-data-from-coventry-university-set-project/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:42.601472"
    },
    {
      "title": "UKRI NERC Digital Future: Tackling the Environmental Challenges of 2040 and beyond",
      "authors": [
        "Halford, A."
      ],
      "year": "2040",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/ukri-nerc-digital-future-tackling-the-environmental-challenges-of/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:49.076820"
    },
    {
      "title": "Sustainable and Inclusive Energy Solutions in Refugee Camps",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/sustainable-and-inclusive-energy-solutions-in-refugee-camps/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:16:55.475780"
    },
    {
      "title": "Negotiating AI, Data Practices, and Ethics",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/negotiating-ai-data-practices-and-ethics/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:01.876017"
    },
    {
      "title": "British Council Pakistan-UK Mobility Program for faculty and students (Consortium of Six Universities across Pakistan and UK)",
      "authors": [
        "Halford, A."
      ],
      "year": "2023",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/british-council-pakistan-uk-mobility-program-for-faculty-and-stud/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:08.299772"
    },
    {
      "title": "Data Practices, Ethics and Energy 4.0​: Understanding UK energy sector practices around data management and data sharing",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/data-practices-ethics-and-energy-40-understanding-uk-energy-secto/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:15.133817"
    },
    {
      "title": "1st Place (Shared) Five Minute Thesis Competition",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/1st-place-shared-five-minute-thesis-competition/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:21.549139"
    },
    {
      "title": "2nd Place Best Academic Poster",
      "authors": [
        "Halford, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/2nd-place-best-academic-poster/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:27.946702"
    },
    {
      "title": "'As Sisters in Zion': how do Mormon women in Britain negotiate gender?",
      "authors": [
        "Halford, A.",
        "Aune, K."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/studentTheses/as-sisters-in-zion-how-do-mormon-women-in-britain-negotiate-gende/",
      "author_profiles": {
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Aune, K.": "https://pureportal.coventry.ac.uk/en/persons/kristin-aune/"
      },
      "crawled_from_author": "Alison Halford",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
      "crawled_at": "2026-01-22T06:17:34.380458"
    },
    {
      "title": "EEG Signal Processing Techniques and Applications—2nd Edition",
      "authors": [
        "He, F."
      ],
      "year": "2025",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/eeg-signal-processing-techniques-and-applications2nd-edition/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:01.079953"
    },
    {
      "title": "Evaluating brain electroencephalogram signal dynamics across cognitive disorders using information geometry",
      "authors": [
        "Kim, E.-J.",
        "He, F."
      ],
      "year": "2025",
      "abstract": "Dementia, including Alzheimer’s disease and frontotemporal dementia, is a progres-sive brain disorder that disrupts memory, thinking, and behavior, with early diagnosis being critical for effective intervention. This study examines the alteration of brain activity caused by dementia by analyzing electroencephalogram (EEG) signals using an infor- mation geometry method known as information rate, which captures the evolving pat- terns of brain signals over time rather than relying on static averages. This method is applied across standard EEG frequency bands – delta, theta, alpha, beta, and gamma– in participants with dementia and healthy controls. The characteristics of the distribu- tion of information rate are studied through the statistical moments (such as mean, vari- ance, skewness, and kurtosis) and Shannon entropy. The statistical comparisons are accessed using the Kruskal-Wallis test with Dunn’s post-hoc analysis, and results are compared against a conventional average-base method using Jensen-Shannon distance. The results show that dynamic features of EEG signals – particularly in the theta, alpha, and beta bands – effectively distinguish Alzheimer’s patients from healthy individuals, while the Shannon entropy of signal dynamics in frontal region differentiates frontotem- poral dementia patients across the theta to gamma bands. Moreover, changes in the occipital region detected by information rate, but not by traditional method, further high- light the importance of capturing temporal variability. The method also successfully dis- tinguishes individuals with Mild Cognitive Impairment from healthy controls, which con- ventional analysis failed to achieve. These results suggest that analyzing the dynamics properties of the brain signals provides a more sensitive and informative approach for identifying and distinguishing various forms of dementia.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/evaluating-brain-electroencephalogram-signal-dynamics-across-cogn/",
      "author_profiles": {
        "Kim, E.-J.": "https://pureportal.coventry.ac.uk/en/persons/e-j-kim/",
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:07.714759"
    },
    {
      "title": "46th Annual International Conference of the IEEE Engineering in Medicine and Biology Society",
      "authors": [
        "He, F."
      ],
      "year": "2024",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/46th-annual-international-conference-of-the-ieee-engineering-in-m/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:27.161933"
    },
    {
      "title": "IEEE Signal Processing in Medicine and Biology Symposium",
      "authors": [
        "He, F."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/ieee-signal-processing-in-medicine-and-biology-symposium/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:33.562939"
    },
    {
      "title": "Healthcare Technology Letters (Journal)",
      "authors": [
        "He, F."
      ],
      "year": "2022",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/healthcare-technology-letters-journal/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:39.994004"
    },
    {
      "title": "Sensors (Journal)",
      "authors": [
        "He, F."
      ],
      "year": "2022",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/sensors-journal-5/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:46.423226"
    },
    {
      "title": "UKRI Future Leaders Fellowships Peer Review College (External organisation)",
      "authors": [
        "He, F."
      ],
      "year": "2021",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/ukri-future-leaders-fellowships-peer-review-college-external-orga/",
      "author_profiles": {
        "He, F.": "https://pureportal.coventry.ac.uk/en/persons/fei-he/"
      },
      "crawled_from_author": "Fei He",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
      "crawled_at": "2026-01-22T06:18:52.839547"
    },
    {
      "title": "Prediction of Steering Angle for Autonomous Vehicles Using Pre-Trained Neural Network",
      "authors": [
        "Jonah, S. S."
      ],
      "year": "2021",
      "abstract": "Autonomous driving is one promising research area that would not only revolutionize the transportation industry but would as well save thousands of lives. accurate correct Steering angle prediction plays a crucial role in the development of the autonomous vehicle .This research attempts to design a model that would be able to clone a drivers behavior using transfer learning from pretrained VGG16, the results showed that the model was able to use less training parameters and achieved a low mean squared error(MSE) of less than 2% without overfitting to the training set hence was able to drive on new road it was not trained on.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/prediction-of-steering-angle-for-autonomous-vehicles-using-pre-tr/",
      "author_profiles": {
        "Jonah, S. S.": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/"
      },
      "crawled_from_author": "Sokipriala Solomon Jonah",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/",
      "crawled_at": "2026-01-22T06:19:13.561789"
    },
    {
      "title": "Traffic Sign Classification Comparison Between Various Convolution Neural Network Models",
      "authors": [
        "Jonah, S. S."
      ],
      "year": "2021",
      "abstract": "Fast detection and accurate classification of traffic signs is one of the major aspects of advance driver assistance system (ADAS) and intelligenttransport systems (ITS), this paper presents a comparison between an 8-Layer convolutional neural network (CNN), and some state of the Arts modelsuch as VGG16 and Resnet50, for traffic sign classification on The GTSRB. using a GPU to increase processing time, the design showed that with variousaugmentation applied to the CNN, our 8-layer Model was able to outperform the State of the Arts models with a higher test Accuracy, 50 times lessertraining parameters, and faster training time our 8 -layer model was able to achieve 96% test accuracy",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/traffic-sign-classification-comparison-between-various-convolutio/",
      "author_profiles": {
        "Jonah, S. S.": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/"
      },
      "crawled_from_author": "Sokipriala Solomon Jonah",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/",
      "crawled_at": "2026-01-22T06:19:20.185203"
    },
    {
      "title": "Adaptive Retransmission for Wireless Sensor Nodes Under Bursty Error Conditions",
      "authors": [
        "Jonah, S. S."
      ],
      "year": "2024",
      "abstract": "Wireless sensor nodes, used in disaster management and industrial applications, typically require high reliability and low energy consumption. This reliability is often hindered due to bursty channel errors in practical wireless systems. The existing retransmission scheme used in IEEE 802.15.4 fails to capture the characteristics of burst channels as they are designed under the assumption of uniform error channels. Thus, they do not significantly improve the reliability under bursty channels while increasing the energy consumption with multiple retransmissions. Our proposed method utilises Reinforcement Learning (RL) to develop an adaptive retransmission strategy. This strategy is informed by analysing the transmission history of the sensor. The RL algorithm learns the optimal policy, which maximises energy efficiency and Packet Delivery Ratio (PDR) in networks with burst channel errors. Our RL retransmission strategy performed better in PDR and energy efficiency than the IEEE 802.15.4 andRetransmission Adaptive Intelligence Medium Access Control (RAI-MAC) proposed in the literature. By adaptively modifying the retransmission strategy, we improved the energy efficiency and PDR by 16% and 10%, respectively, under a 10-15% packet error rate. The results highlight the importance of an adaptive retransmission strategy for resource-constrained wireless sensors.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/adaptive-retransmission-for-wireless-sensor-nodes-under-bursty-er/",
      "author_profiles": {
        "Jonah, S. S.": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/"
      },
      "crawled_from_author": "Sokipriala Solomon Jonah",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/",
      "crawled_at": "2026-01-22T06:19:27.003637"
    },
    {
      "title": "Why aren't we teaching this? Smart local energy systems and the young person's perspective",
      "authors": [
        "Ingram, C.",
        "Halford, A.",
        "Jonah, S."
      ],
      "year": "2024",
      "abstract": "With the UK government's target of Net Zero by 2050, alongside the rising cost of energy in the UK, it is imperative that public opinion aligns with and promotes affordable, greener energy systems. Within this dialogue, young people’s voices and lived experience are needed to deepen the impact of energy policy intervention strategies. This article stresses the importance of a formal curriculum that informs future generations on the subjects of Smart Local Energy Systems (SLES), and the digitalisation advances of energy systems. This paper explores the development of a toolkit to educate and engage young people in these subjects, and reviews young people’s attitudes and understanding from three schools in England, UK. We find through an interpretive qualitative analysis of both images drawn by the young people, and insights gathered from focus groups, that i) for these young people, SLES are a useful innovation regarding energy management and distribution, ii) young people recognise that the education system as it currently stands is not aware of, or informed by smart energy technologies and iii) that despite being a generation that is the most integrated with personal assistance technology, these young people have significant concerns over the reliability and safety of AI in SLES. These findings are set alongside calls for widespread education in key stages 4 and 5 (ages 14-18) around the subject of SLES, and their benefits to wider society, thereby enabling a future that empowers young people to make change, encourage engineering and computer science-based career options and secure a fairer, cleaner, sustainable energy transition in the future.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/why-arent-we-teaching-this-smart-local-energy-systems-and-the-you/",
      "author_profiles": {
        "Ingram, C.": "https://pureportal.coventry.ac.uk/en/persons/charlie-ingram/",
        "Halford, A.": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
        "Jonah, S.": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/"
      },
      "crawled_from_author": "Sokipriala Solomon Jonah",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/",
      "crawled_at": "2026-01-22T06:19:33.596975"
    },
    {
      "title": "Continuous Human Activity Recognition using Radar Imagery and Dynamic Time Warping",
      "authors": [
        "Mehta, R.",
        "Palade, V."
      ],
      "year": "2023",
      "abstract": "Remote Human Activity Recognition (HAR) in a private residential area has a beneficial influence on the elderly population's life, since this group of people require regular monitoring of health conditions. This paper addresses the problem of continuous detection of daily human activities using mm-wave Doppler radar. Unlike most previous research, this work records the data in terms of continuous series of activities rather than individual activities. These series of activities are similar to real-life activity patterns. The Dynamic Time Warping (DTW) algorithm is used for the detection of human activities in the recorded time series of data and compared to other time-series classification methods. DTW requires less amount of labelled data. The input for DTW was provided using three strategies, and the obtained results were compared against each other. The first approach uses the pixel-level data of frames (named UnSup-PLevel). In the other two strategies, a Convolutional Variational Autoencoder (CVAE) is used to extract Un-Supervised Encoded features (UnSup-EnLevel) and Supervised Encoded features (Sup-EnLevel) from the series of Doppler frames. Results demonstrates the superiority of the Sup-EnLevel features over UnSup-EnLevel and UnSup-PLevel strategies. However, the performance of the UnSup-PLevel strategy worked surprisingly well without using annotations.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/continuous-human-activity-recognition-using-radar-imagery-and-dyn/",
      "author_profiles": {
        "Mehta, R.": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Ruchita Mehta",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
      "crawled_at": "2026-01-22T06:20:21.841375"
    },
    {
      "title": "Deep Learning Techniques for Radar-Based Continuous Human Activity Recognition",
      "authors": [
        "Mehta, R.",
        "Palade, V."
      ],
      "year": "2023",
      "abstract": "Human capability to perform routine tasks declines with age and age-related problems. Remote human activity recognition (HAR) is beneficial for regular monitoring of the elderly population. This paper addresses the problem of the continuous detection of daily human activities using a mm-wave Doppler radar. In this study, two strategies have been employed: the first method uses un-equalized series of activities, whereas the second method utilizes a gradient-based strategy for equalization of the series of activities. The dynamic time warping (DTW) algorithm and Long Short-term Memory (LSTM) techniques have been implemented for the classification of un-equalized and equalized series of activities, respectively. The input for DTW was provided using three strategies. The first approach uses the pixel-level data of frames (UnSup-PLevel). In the other two strategies, a convolutional variational autoencoder (CVAE) is used to extract Un-Supervised Encoded features (UnSup-EnLevel) and Supervised Encoded features (Sup-EnLevel) from the series of Doppler frames. The second approach for equalized data series involves the application of four distinct feature extraction methods: i.e., convolutional neural networks (CNN), supervised and unsupervised CVAE, and principal component Analysis (PCA). The extracted features were considered as an input to the LSTM. This paper presents a comparative analysis of a novel supervised feature extraction pipeline, employing Sup-ENLevel-DTW and Sup-EnLevel-LSTM, against several state-of-the-art unsupervised methods, including UnSUp-EnLevel-DTW, UnSup-EnLevel-LSTM, CNN-LSTM, and PCA-LSTM. The results demonstrate the superiority of the Sup-EnLevel-LSTM strategy. However, the UnSup-PLevel strategy worked surprisingly well without using annotations and frame equalization.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/deep-learning-techniques-for-radar-based-continuous-human-activit/",
      "author_profiles": {
        "Mehta, R.": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Ruchita Mehta",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
      "crawled_at": "2026-01-22T06:20:28.510057"
    },
    {
      "title": "Multi-Sensor based Human Activity Recognition",
      "authors": [
        "Mehta, R.",
        "Palade, V."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/datasets/multi-sensor-based-human-activity-recognition/",
      "author_profiles": {
        "Mehta, R.": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Ruchita Mehta",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
      "crawled_at": "2026-01-22T06:20:35.185457"
    },
    {
      "title": "Future Algorithms",
      "authors": [
        "Nageen, M."
      ],
      "year": "2024",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/future-algorithms-2/",
      "author_profiles": {
        "Nageen, M.": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/"
      },
      "crawled_from_author": "Mashaal Nageen",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/",
      "crawled_at": "2026-01-22T06:20:55.019910"
    },
    {
      "title": "Clinical Parasitology Workshop",
      "authors": [
        "Nageen, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/clinical-parasitology-workshop-2/",
      "author_profiles": {
        "Nageen, M.": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/"
      },
      "crawled_from_author": "Mashaal Nageen",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/",
      "crawled_at": "2026-01-22T06:21:01.438559"
    },
    {
      "title": "Lab Equipment Calibration & ISO Standards",
      "authors": [
        "Nageen, M."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/lab-equipment-calibration-amp-iso-standards/",
      "author_profiles": {
        "Nageen, M.": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/"
      },
      "crawled_from_author": "Mashaal Nageen",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/",
      "crawled_at": "2026-01-22T06:21:07.794003"
    },
    {
      "title": "Farmland Segmentation in Landsat 8 Satellite Images Using Deep Learning and Conditional Generative Adversarial Networks",
      "authors": [
        "Nair, S.",
        "Palade, V."
      ],
      "year": "2024",
      "abstract": "Leveraging mid-resolution satellite images such as Landsat 8 for accurate farmland segmentation and land change monitoring is crucial for agricultural management, yet is hindered by the scarcity of labelled data for the training of supervised deep learning pipelines. The particular focus of this study is on addressing the scarcity of labelled images. This paper introduces several contributions, including a systematic satellite image data augmentation approach that aims to maintain data population consistency during model training, thus mitigating performance degradation. To alleviate the labour-intensive task of pixel-wise image labelling, we present a novel application of a modified conditional generative adversarial network (CGAN) to generate artificial satellite images and corresponding farm labels. Additionally, we scrutinize the role of spectral bands in satellite image segmentation and compare two prominent semantic segmentation models, U-Net and DeepLabV3+, with diverse backbone structures. Our empirical findings demonstrate that augmenting the dataset with up to 22.85% artificial samples significantly enhances the model performance. Notably, the U-Net model, employing standard convolution, outperforms the DeepLabV3+ models with atrous convolution, achieving a segmentation accuracy of 86.92% on the test data.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/farmland-segmentation-in-landsat-8-satellite-images-using-deep-le/",
      "author_profiles": {
        "Nair, S.": "https://pureportal.coventry.ac.uk/en/persons/shruti-suresh-nair/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Shruti Suresh Nair",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/shruti-suresh-nair/",
      "crawled_at": "2026-01-22T06:21:21.669346"
    },
    {
      "title": "Behaviour of Outsourced Employees as Sources of Information System Security Threats",
      "authors": [
        "Oyebisi, D."
      ],
      "year": "2020",
      "abstract": "There is an increased need for information systems to be protected against unauthorized access and retrieval, particularly from legitimate ‘insider’ outsourced employees. While most studies have focused on organisations’ employees as threats, only a few have focused on the role the outsourced employees’ play as a potential threat. The study seeks to investigate the insider threat behaviour of an outsourced employee in developing countries as security threats to information systems by virtue of their privileged access. The study is quantitative and adopts social bond and involvement theories for this purpose. The research sample was chosen from organisations in Nigeria and South Africa which are the largest two national economies in Africa. Close-ended questionnaires were used and the data were analysed using factor analysis. The study found that outsourced employees exploit information systems vulnerabilities because they are not actively involved in the organisation and lack moral values and beliefs. The findings of this study will assist organisations in developing countries to mitigate the information security threats posed by outsourced employees.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/behaviour-of-outsourced-employees-as-sources-of-information-syste/",
      "author_profiles": {
        "Oyebisi, D.": "https://pureportal.coventry.ac.uk/en/persons/david-oyebisi/"
      },
      "crawled_from_author": "David Oyebisi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/david-oyebisi/",
      "crawled_at": "2026-01-22T06:21:48.824826"
    },
    {
      "title": "Outsourcing Deviance: When 3rd Party Technology Innovativeness Becomes a Threat to Information Systems",
      "authors": [
        "Oyebisi, D."
      ],
      "year": "2018",
      "abstract": "Innovation may not be necessarily be confined to new technologies alone. It may also extend to new ways people are using innovative technologies to interact with information systems. Such interactions may be benevolent, to protect systems, while other system interactions could be malevolent. Anecdotal discourse traces information systems threats emanating from increased malevolent behavior from both the employee of an organization as well as the employee of an outsourced organisation. This study uniquely seeks to share insights to the role the outsourced employee has become from two fronts; firstly that innovative technologies have increasingly enabled malevolent behavior and secondly; with the advent of outsourcing, monovalent activities in information systems has extended to the employees of an outsourced organisation. The study adopts the social bonding theory to explain these insights. A conceptual framework has been developed and tested in order to best represent the security threat posed to information systems by employees of an outsourced organisation. The research is quantitative with hypotheses formulated and tested. Findings suggested that innovative people and technologies has enabled more serious information security threats to be instigated. This is especially the case from the employees of an outsourced organisation.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/outsourcing-deviance-when-3rd-party-technology-innovativeness-bec/",
      "author_profiles": {
        "Oyebisi, D.": "https://pureportal.coventry.ac.uk/en/persons/david-oyebisi/"
      },
      "crawled_from_author": "David Oyebisi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/david-oyebisi/",
      "crawled_at": "2026-01-22T06:21:55.525221"
    },
    {
      "title": "Video Annotation tool to 'train' connected and autonomous vehicles",
      "authors": [
        "haas, O.",
        "Palade, V.",
        "Vincent, K.",
        "Pandey, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/projects/video-annotation-tool-to-train-connected-and-autonomous-vehicles/",
      "author_profiles": {
        "haas, O.": "https://pureportal.coventry.ac.uk/en/persons/o-c-l-haas/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
        "Vincent, K.": "https://pureportal.coventry.ac.uk/en/persons/kevin-vincent/",
        "Pandey, A.": "https://pureportal.coventry.ac.uk/en/persons/anup-pandey-2/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:09.803743"
    },
    {
      "title": "Cognitive Computing and Business Intelligence Applications in Accounting, Finance and Management",
      "authors": [
        "Palade, V."
      ],
      "year": "2025",
      "abstract": "Cognitive computing encompasses computing tools and methods that simulate and mimic the process of human thinking, without human supervision. Deep neural network architectures, natural language processing, big data tools, and self-learning tools based on pattern recognition have been widely deployed to solve highly complex problems. Business intelligence enhances collaboration among different organizational departments with data-driven conversations and provides an organization with meaningful data interpretation for making strategic decisions on time. Since the introduction of ChatGPT in November 2022, the tremendous impacts of using Large Language Models have been rippling through cognitive computing, business intelligence, and their applications in accounting, finance, and management. Unlike other recent reviews in related areas, this review focuses precisely on the cognitive computing perspective, with frontier applications in accounting, finance, and management. Some current limitations and future directions of cognitive computing are also discussed.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/cognitive-computing-and-business-intelligence-applications-in-acc/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:22.500717"
    },
    {
      "title": "Double-Graph Representation With Relational Enhancement for Emotion–Cause Pair Extraction",
      "authors": [
        "Palade, V."
      ],
      "year": "2025",
      "abstract": "The emotion–cause pair extraction (ECPE) task is to simultaneously extract emotions and causes as pairs (EC-pairs) from documents, which is important for natural language processing. Previous research tackled this task via a two-step approach, which first predicts separately the emotion and cause clauses, and then pairs them up by using a binary classifier. However, such a two-step approach may suffer from the possible propagation of errors, and it neglects the interaction between emotions and causes. In this article, an end-to-end double-graph method with relational enhancement (DGRE) is proposed to stimulate two relationship modes among clauses, i.e., semantic dependence and logical dependence. First, two united graph encoders are established to embed the semantic dependence into the representation of clauses and pairs. The first encoder is built on graph attention networks (GATs) for clause-level representation, the result of which is used by a relational graph convolutional network (RGCN) for the refinement of pair-level representation. Aiming to enhance the fitting ability of logical dependence, the emotion-type classification task is introduced into the multitask learning framework of GATs, which can effectively distinguish the logical relations between clauses according to their emotion types. Moreover, seven types of dependence relations have been designed for the node connections in RGCN, which emphasize the contextual interaction and clustering among neighboring nodes. Experiments on a benchmark Chinese corpus demonstrate that the proposed DGRE approach could effectively establish the communication mechanism between clauses and pairs from multiple perspectives, and comparisons with state-of-the-art (SOTA) models well validate its effectiveness.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/double-graph-representation-with-relational-enhancement-for-emoti/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:29.646191"
    },
    {
      "title": "Human-in-the-Loop XAI for Predictive Maintenance: A Systematic Review of Interactive Systems and Their Effectiveness in Maintenance Decision-Making",
      "authors": [
        "Amaliah, N. R.",
        "Tjahjono, B.",
        "Palade, V."
      ],
      "year": "2025",
      "abstract": "Artificial intelligence (AI) plays a pivotal role in Industry 4.0, with predictive maintenance (PdM) emerging as a core application for improving operational efficiency by reducing unplanned downtime and extending asset life. Despite these advancements, the black-box nature of AI models remains a significant barrier to adoption, as industry stakeholders require systems that are both transparent and trustworthy. This study presents a systematic literature review examining how human-in-the-loop explainable AI (HITL-XAI) approaches can enhance the effectiveness and adoption of AI systems in PdM contexts. This review followed the PRISMA methodology, employing predefined search strings across Scopus, ProQuest, and EBSCO databases. Sixty-three peer-reviewed journal articles, published between 2019 and early 2025, were included in the final analysis. The selected studies span various domains, including industrial manufacturing, energy, and transportation, with findings synthesized through both descriptive and thematic analyses. A key gap identified is the limited empirical exploration of generative AI (GenAI) in improving the usability, interpretability, and trustworthiness of HITL-XAI systems in PdM applications. This review outlines actionable insights for integrating explainability and GenAI into existing rule-based PdM systems to support more adaptive and reliable maintenance strategies. Ultimately, the findings underscore the importance of designing HITL-XAI systems that not only demonstrate high model performance but are also effectively aligned with operational workflows and the cognitive needs of maintenance personnel.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/human-in-the-loop-xai-for-predictive-maintenance-a-systematic-rev/",
      "author_profiles": {
        "Amaliah, N. R.": "https://pureportal.coventry.ac.uk/en/persons/nuuraan-risqi-amaliah/",
        "Tjahjono, B.": "https://pureportal.coventry.ac.uk/en/persons/benny-tjahjono/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:36.317822"
    },
    {
      "title": "Leveraging Physics-Informed Neural Networks for Efficient Modelling of Coastal Ecosystems Dynamics: A Case Study of Sundarbans Mangrove Forest",
      "authors": [
        "Eden, J.",
        "Palade, V."
      ],
      "year": "2025",
      "abstract": "Modelling the hydro-morphodynamics of mangrove environments poses significant challenges due to their complex geometry, dynamic vegetation-water interactions, and limited in situ measurements. Traditional numerical models struggle in such settings due to high computational cost, the need for extensive mesh generation, and difficulties in assimilating heterogeneous data sources. To overcome these limitations, this study proposes a hybrid Physics-Informed Neural Networks (PINNs) framework that integrates governing physical laws, satellite-derived vegetation data, and outputs from high- resolution Computational Fluid Dynamics (CFD) simulations of the Sundarbans mangrove system. The proposed hybrid PINN model incorporates shallow water flow and sediment transport equations into the loss function and uses a temporal causality weighting mechanism to improve convergence in time-dependent domains. Model outputs include elevation, flow velocity, and suspended sediment concentration. The model is trained using a small subset of CFD simulation data and validated against a traditional finite element (FE) solver and a Convolutional Neural Network (CNN) baseline. The proposed hybrid PINNs model achieved RMSE values in the range of 10−2for elevation and velocity and 10−3for sediment concentration, significantly outperforming the CNN model, particularly in generalising to unseen time steps. Compared to the FE model, the proposed framework achieved a five-fold reduction in training time (24 h vs. 5 days) and supports inference within seconds, enabling near real-time predictions. The mesh-free structure of the model, combined with its physics-regularised learning, also facilitates adaptation to other coastal or mangrove systems governed by similar dynamics. This hybrid approach offers a robust, generalisable surrogate for high-fidelity coastal simulations in data-scarce and computationally demanding environments.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/leveraging-physics-informed-neural-networks-for-efficient-modelli/",
      "author_profiles": {
        "Eden, J.": "https://pureportal.coventry.ac.uk/en/persons/jonathan-eden/",
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:43.017438"
    },
    {
      "title": "Advances in interactive Knowledge Discovery and Data\nMining in complex and big data sets",
      "authors": [
        "Palade, V."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/advances-in-interactive-knowledge-discovery-and-datamining-in-com/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:22:55.774710"
    },
    {
      "title": "DCABES 2015 - The 14th International Symposium on Distributed Computing and Applications for Business\nEngineering and Science",
      "authors": [
        "Palade, V."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/dcabes-2015-the-14th-international-symposium-on-distributed-compu/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:23:02.177246"
    },
    {
      "title": "2015 IEEE 14th International Conference on Machine Learning and Applications",
      "authors": [
        "Palade, V."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/2015-ieee-14th-international-conference-on-machine-learning-and-a/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:23:08.595024"
    },
    {
      "title": "ICTAI 2015 (IEEE Int. Conf. on Tools with Artificial Intelligence)",
      "authors": [
        "Palade, V."
      ],
      "year": "2015",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/ictai-2015-ieee-int-conf-on-tools-with-artificial-intelligence/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:23:15.012007"
    },
    {
      "title": "CIFEr 2014 - The IEEE Conference on Computational Intelligence for Financial Engineering and Economics",
      "authors": [
        "Palade, V."
      ],
      "year": "2014",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/cifer-2014-the-ieee-conference-on-computational-intelligence-for-/",
      "author_profiles": {
        "Palade, V.": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/"
      },
      "crawled_from_author": "Vasile Palade",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
      "crawled_at": "2026-01-22T06:23:21.427870"
    },
    {
      "title": "Best Poster Award",
      "authors": [
        "Qazi, A. J."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/best-poster-award/",
      "author_profiles": {
        "Qazi, A. J.": "https://pureportal.coventry.ac.uk/en/persons/adeen-jawad-qazi/"
      },
      "crawled_from_author": "Adeen Jawad Qazi",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/adeen-jawad-qazi/",
      "crawled_at": "2026-01-22T06:23:41.299954"
    },
    {
      "title": "Understanding Multistationarity of Fully Open Reaction Networks",
      "authors": [
        "Sadeghimanesh, A.",
        "England, M."
      ],
      "year": "2025",
      "abstract": "This work addresses multistationarity of fully open reaction networks equipped with mass action kinetics. We improve upon existing results relating existence of positive feedback loops in a reaction network and multistationarity; and we provide a novel deterministic operation to generate new non-multistationary networks. This is interesting because while there were many operations to create infinitely many new multistationary networks from a multistationary example, this is the first such operation for the non-multistationary counterpart.Such tools for the generation of example networks have a use-case in the application of data science to reaction network theory. We demonstrate this by using new data, along with a novel graph representation of reaction networks that is unique up to a permutation on the name of species of the network, to train a graph attention neural network model to predict multistationarity of reaction networks. This is the first time machine learning tools are used for studying classification problems of reaction networks.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/understanding-multistationarity-of-fully-open-reaction-networks/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:01.753568"
    },
    {
      "title": "Polynomial Superlevel Set Representation of the Multistationarity Region of Chemical Reaction Networks",
      "authors": [
        "Sadeghimanesh, A.",
        "England, M."
      ],
      "year": "2022",
      "abstract": "In this paper we introduce a new representation for the multistationarity region of a reaction network, using polynomial superlevel sets. The advantages of using this polynomial superlevel set representation over the formerly existing representations (cylindrical algebraic decompositions, numeric sampling, rectangular division) is discussed, and algorithms to compute this new representation are provided. The results are given for the general mathematical formalism of a parametric system of equations and therefore can be used in other application areas.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/polynomial-superlevel-set-representation-of-the-multistationarity/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:08.441948"
    },
    {
      "title": "Kac-Rice formulas and the number of solutions of parametrized systems of polynomial equations",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "2022",
      "abstract": "Kac-Rice formulas express the expected number of elements a fiber of a random field has in terms of a multivariate integral. We consider here parametrized systems of polynomial equations that are linear in enough parameters, and provide a Kac-Rice formula for the expected number of solutions of the system when the parameters follow continuous distributions. Combined with Monte Carlo integration, we apply the formula to partition the parameter region according to the number of solutions or find a region in parameter space where the system has the maximal number of solutions. The motivation stems from the study of steady states of chemical reaction networks and gives new tools for the open problem of identifying the parameter region where the network has at least two positive steady states. We illustrate with numerous examples that our approach successfully handles a larger number of parameters than exact methods.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/kac-rice-formulas-and-the-number-of-solutions-of-parametrized-sys/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:15.126514"
    },
    {
      "title": "Exotic bifurcations in three connected populations with Allee effect",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "2021",
      "abstract": "We consider three connected populations with Allee effect, and give a complete classification of the steady state structure of the system with respect to the Allee threshold and the dispersal rate, describing the bifurcations at each critical point where the number of steady states change. One may expect that by increasing the dispersal rate between the patches, the system would become more well-mixed hence simpler, however we show that it is not always the case, and the number of steady states may (temporarily) increase by increasing the dispersal rate. Besides sequences of pitchfork and saddle-node bifurcations, we find triple-transcritical bifurcations and also a sun-ray shaped bifurcation where twelve steady states meet at a single point then disappear.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/exotic-bifurcations-in-three-connected-populations-with-allee-eff/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:22.317724"
    },
    {
      "title": "Clustering in the Lazard method for Cylindrical Algebraic Decomposition",
      "authors": [
        "Sadeghimanesh, A.",
        "England, M."
      ],
      "year": "2023",
      "abstract": "Cylindrical Algebraic Decomposition (CAD) is an algorithm originally proposed by Collins in [4]. Given a set of multivariate polynomials, CAD decomposes the multidimensional real space into connected subsets called cells, within which those polynomials are sign-invariant.",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/publications/clustering-in-the-lazard-method-for-cylindrical-algebraic-decompo/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
        "England, M.": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:28.913034"
    },
    {
      "title": "Chatchawan Panraksa",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "2025",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/chatchawan-panraksa/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:41.681811"
    },
    {
      "title": "2025 British Final of the Logic and Mathematical Games",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "2025",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/2025-british-final-of-the-logic-and-mathematical-games/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:48.124382"
    },
    {
      "title": "Designing Machine Learning Tools to Characterize Multi-stationarity of Fully Open Reaction Networks",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/designing-machine-learning-tools-to-characterize-multi-stationari/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:24:54.539208"
    },
    {
      "title": "Designing Machine Learning Tools to Characterize Multistationarity of Fully Open Reaction Networks",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/designing-machine-learning-tools-to-characterize-multistationarit/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:00.954421"
    },
    {
      "title": "Designing machine learning tools to characterize multistationarity of fully open reaction networks",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/activities/designing-machine-learning-tools-to-characterize-multistationarit-2/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:07.387966"
    },
    {
      "title": "Silver medal",
      "authors": [
        "Sadeghi Manesh, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/silver-medal/",
      "author_profiles": {
        "Sadeghi Manesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:13.800053"
    },
    {
      "title": "Finalist in the Mathematics category of STEM for Britain",
      "authors": [
        "Sadeghi Manesh, A. S."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/finalist-in-the-mathematics-category-of-stem-for-britain/",
      "author_profiles": {
        "Sadeghi Manesh, A. S.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:20.217551"
    },
    {
      "title": "CU Social Impact Challenge 2023 on Sustainable Development Goals",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "2023",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/cu-social-impact-challenge-2023-on-sustainable-development-goals/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:26.667138"
    },
    {
      "title": "The most active participant at Maple Conference 2021",
      "authors": [
        "Sadeghimanesh, A."
      ],
      "year": "",
      "abstract": "",
      "keywords": [],
      "publication_link": "https://pureportal.coventry.ac.uk/en/prizes/the-most-active-participant-at-maple-conference-2021/",
      "author_profiles": {
        "Sadeghimanesh, A.": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/"
      },
      "crawled_from_author": "AmirHosein Sadeghimanesh",
      "crawled_from_profile": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
      "crawled_at": "2026-01-22T06:25:33.169365"
    }
  ],
  "author_profiles": {
    "Faizan Ahmed": "https://pureportal.coventry.ac.uk/en/persons/faizan-ahmed/",
    "Michael Ajao-olarinoye": "https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye/",
    "Opeoluwa Akinseloyin": "https://pureportal.coventry.ac.uk/en/persons/opeoluwa-akinseloyin/",
    "Emran Ali": "https://pureportal.coventry.ac.uk/en/persons/emran-ali/",
    "Herimampionona Andriniaina": "https://pureportal.coventry.ac.uk/en/persons/herimampionona-andriniaina/",
    "Kinza Arshad": "https://pureportal.coventry.ac.uk/en/persons/kinza-arshad/",
    "Abiola Babatunde": "https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde/",
    "Karthik Bangalore Muniraju": "https://pureportal.coventry.ac.uk/en/persons/karthik-bangalore-muniraju/",
    "Rashid Barket": "https://pureportal.coventry.ac.uk/en/persons/rashid-barket/",
    "James Brusey": "https://pureportal.coventry.ac.uk/en/persons/james-brusey/",
    "Aniket Dixit": "https://pureportal.coventry.ac.uk/en/persons/aniket-dixit/",
    "Fatema Mahmoud Salama Elgebali": "https://pureportal.coventry.ac.uk/en/persons/fatema-mahmoud-salama-elgebali/",
    "Matthew England": "https://pureportal.coventry.ac.uk/en/persons/matthew-england/",
    "Dan Flood, MA BSc(Hons) FHEA": "https://pureportal.coventry.ac.uk/en/persons/dan-flood/",
    "Sivasharmini Ganeshamoorthy": "https://pureportal.coventry.ac.uk/en/persons/sivasharmini-ganeshamoorthy/",
    "Elena Gaura": "https://pureportal.coventry.ac.uk/en/persons/elena-gaura/",
    "Abdorasoul Ghasemi": "https://pureportal.coventry.ac.uk/en/persons/abdorasoul-ghasemi/",
    "Stephan Goerttler": "https://pureportal.coventry.ac.uk/en/persons/stephan-goerttler/",
    "Raj Gunawardena": "https://pureportal.coventry.ac.uk/en/persons/raj-gunawardena/",
    "Alison Halford": "https://pureportal.coventry.ac.uk/en/persons/alison-halford/",
    "Ihsan Ul Haq": "https://pureportal.coventry.ac.uk/en/persons/ihsan-ul-haq/",
    "Fei He": "https://pureportal.coventry.ac.uk/en/persons/fei-he/",
    "Iqra Jilani": "https://pureportal.coventry.ac.uk/en/persons/iqra-jilani/",
    "Sokipriala Solomon Jonah": "https://pureportal.coventry.ac.uk/en/persons/sokipriala-solomon-jonah/",
    "Abhishek Kallarappayi": "https://pureportal.coventry.ac.uk/en/persons/abhishek-kallarappayi/",
    "Sakkarin Karoonwong": "https://pureportal.coventry.ac.uk/en/persons/sakkarin-karoonwong/",
    "Kartik Kartik": "https://pureportal.coventry.ac.uk/en/persons/kartik/",
    "Muhammad Ibrahim Khan": "https://pureportal.coventry.ac.uk/en/persons/muhammad-ibrahim-khan/",
    "Ruchita Mehta": "https://pureportal.coventry.ac.uk/en/persons/ruchita-mehta/",
    "Taliqa Muhib": "https://pureportal.coventry.ac.uk/en/persons/taliqa-muhib/",
    "Mashaal Nageen": "https://pureportal.coventry.ac.uk/en/persons/mashaal-nageen/",
    "Shruti Suresh Nair": "https://pureportal.coventry.ac.uk/en/persons/shruti-suresh-nair/",
    "Theophilus Nasali": "https://pureportal.coventry.ac.uk/en/persons/theophilus-nasali/",
    "Vu Trung Nguyen": "https://pureportal.coventry.ac.uk/en/persons/vu-trung-nguyen/",
    "David Oyebisi": "https://pureportal.coventry.ac.uk/en/persons/david-oyebisi/",
    "Vasile Palade": "https://pureportal.coventry.ac.uk/en/persons/vasile-palade/",
    "Bivin Pradeep": "https://pureportal.coventry.ac.uk/en/persons/bivin-pradeep/",
    "Adeen Jawad Qazi": "https://pureportal.coventry.ac.uk/en/persons/adeen-jawad-qazi/",
    "Supriya Roy": "https://pureportal.coventry.ac.uk/en/persons/supriya-roy/",
    "AmirHosein Sadeghimanesh": "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh/",
    "Uzma Shafiq": "https://pureportal.coventry.ac.uk/en/persons/uzma-shafiq/",
    "Mohamad Hasan Sohan Ajini": "https://pureportal.coventry.ac.uk/en/persons/mohamad-hasan-sohan-ajini/",
    "Julia Wieczorek": "https://pureportal.coventry.ac.uk/en/persons/julia-wieczorek/",
    "Kaidong Wu": "https://pureportal.coventry.ac.uk/en/persons/kaidong-wu/",
    "Suleiman Adamu Yakubu": "https://pureportal.coventry.ac.uk/en/persons/suleiman-adamu-yakubu/",
    "Haili Ye": "https://pureportal.coventry.ac.uk/en/persons/haili-ye/",
    "Cong Zhou": "https://pureportal.coventry.ac.uk/en/persons/cong-zhou/"
  }
}